DragonFlyBSD/DragonFlyBSD/sbin/fsck_hammer2/fsck_hammer2.8
.\" Copyright (c) 2019 Tomohiro Kusumi <tkusumi@netbsd.org>
.\" Copyright (c) 2019 The DragonFly Project
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The DragonFly Project
.\" by Matthew Dillon <dillon@backplane.com>
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\"
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in
.\"    the documentation and/or other materials provided with the
.\"    distribution.
.\" 3. Neither the name of The DragonFly Project nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific, prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
.\" LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
.\" FOR A PARTICULAR PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE
.\" COPYRIGHT HOLDERS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
.\" OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd October 2, 2019
.Dt FSCK_HAMMER2 8
.Os
.Sh NAME
.Nm fsck_hammer2
.Nd HAMMER2 file system consistency checker
.Sh SYNOPSIS
.Nm
.Op Fl f
.Op Fl v
.Op Fl q
.Op Fl p
.Op Fl l Ar pfs_name
.Ar special
.Sh DESCRIPTION
The
.Nm
utility verifies
.Tn HAMMER2
file system.
There is currently no file system repairing.
.Bl -tag -width indent
.It Fl f
Force option.
.It Fl v
Verbose option.
.It Fl q
Quiet option.
.It Fl p
Scan each PFS separately.
.It Fl l
Specify PFS to scan when
.Fl p
is used.
.El
.Sh SEE ALSO
.Xr fsck 8 ,
.Xr hammer2 8 ,
.Xr newfs_hammer2 8 ,
.Xr mount_hammer2 8
.Sh HISTORY
The
.Nm
utility appeared in
.Dx 5.7 .
.Sh BUGS
The
.Nm
utility is currently under development.
.Sh AUTHORS
.An Tomohiro Kusumi Aq Mt tkusumi@netbsd.org
