DragonFlyBSD/DragonFlyBSD/usr.sbin/rndcontrol/rndcontrol.8
.\"
.\" Copyright (c) 1995
.\"	Mark Murray.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY MARK MURRAY AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD: src/usr.sbin/rndcontrol/rndcontrol.8,v 1.13.2.2 2001/12/21 09:05:32 ru Exp $
.\" $DragonFly: src/usr.sbin/rndcontrol/rndcontrol.8,v 1.5 2006/07/10 22:52:31 dillon Exp $
.\"
.Dd October 20, 1995
.Dt RNDCONTROL 8
.Os
.Sh NAME
.Nm rndcontrol
.Nd a utility for manipulating the
.Pa /dev/random
device
.Sh SYNOPSIS
.Nm
.Op Fl q
.Op Fl s Ar irq_no
.Op Fl c Ar irq_no
.Sh DESCRIPTION
The
.Nm
command is used to set which interrupts are used to help add entropy
to the CSPRNG maintained by the kernel.
The
.Pa /dev/random
and
.Pa /dev/urandom
devices are the user interface to this source of randomness.
Any changes take effect immediately.
.Pp
The following command line options are supported:
.Bl -tag -width indent
.It Fl q
Turn off all output except errors.
.It Fl s Ar n
Allow IRQ
.Ar n
to be used as a source of randomness.
This option may be repeated for
more than one IRQ.
.It Fl c Ar n
Stop IRQ
.Ar n
from being used as a source of randomness.
This option may be repeated for
more than one IRQ.
.El
.Pp
By default, all IRQs will help develop entropy.  The kernel uses a
rate-limited helper thread to add the actual entropy and even fast
interrupts should not detrimentally effect a running system.
.Sh FILES
.Bl -tag -width ".Pa /dev/urandom" -compact
.It Pa /dev/random
secure random device
.It Pa /dev/urandom
random device
.El
.Sh SEE ALSO
.Xr random 4 ,
.Xr srandomdev 3
.Sh HISTORY
The
.Nm
utility first appeared in
.Fx 2.1.5 .
.Sh AUTHORS
.An -nosplit
.An Theodore Ts'o
wrote the core code.
.An Mark Murray
ported this code to
.Fx
and wrote the support routines and constructed the man pages.
.Sh BUGS
Sure to be some.
