DragonFlyBSD/DragonFlyBSD/tools/multimedia/cxm/extract_fw/cxm_extract_fw.8
.\"
.\" Copyright (c) 2009
.\"	The DragonFly Project.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\"
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in
.\"    the documentation and/or other materials provided with the
.\"    distribution.
.\" 3. Neither the name of The DragonFly Project nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific, prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
.\" LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
.\" FOR A PARTICULAR PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE
.\" COPYRIGHT HOLDERS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
.\" OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd April 19, 2009
.Dt CXM_EXTRACT_FW 8
.Os
.Sh NAME
.Nm cxm_extract_fw
.Nd convert Windows\[rg] firmware for use with
.Xr cxm 4
.Sh SYNOPSIS
.Nm
.Ar file
.\".Op Ar file
.Sh DESCRIPTION
The
.Nm
utility transforms
.Xr cxm 4
.Tn Windows\[rg]
firmware into C language files which are needed for the driver to work.
.Pp
In order to create those files, run the
.Nm
utility on the
.Pa hcwPVRP2.sys
file which came on the
.Tn Windows\[rg]
driver CD-ROM.
The resulting
.Pa cxm_dec_fw.c
and
.Pa cxm_enc_fw.c
files have then to be copied to the
.Xr cxm 4
source directory (usually
.Pa /usr/src/sys/dev/video/cxm )
before compiling the kernel.
.Sh SEE ALSO
.Xr cxm 4
.Sh HISTORY
The
.Nm
program was ported to
.Dx 2.3
by
.An Sascha Wildner .
.Sh AUTHORS
.An -nosplit
This program was made by
.An John Wehle Aq Mt john@feith.com .
.Pp
This manual page was written by
.An Sascha Wildner Aq Mt saw@online.de .
