DragonFlyBSD/DragonFlyBSD/sbin/getdevpath/getdevpath.8
.\"
.\" Copyright (c) 2009 The DragonFly Project.  All rights reserved.
.\"
.\" This code is derived from software contributed to The DragonFly Project
.\" by Matthew Dillon <dillon@backplane.com>
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\"
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in
.\"    the documentation and/or other materials provided with the
.\"    distribution.
.\" 3. Neither the name of The DragonFly Project nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific, prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
.\" LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
.\" FOR A PARTICULAR PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE
.\" COPYRIGHT HOLDERS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
.\" OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd July 10, 2009
.Dt GETDEVPATH 8
.Os
.Sh NAME
.Nm getdevpath
.Nd "translate device partial or label to device path"
.Sh SYNOPSIS
.Nm
.Op Fl qr
.Ar devname ...
.Sh DESCRIPTION
The
.Nm
utility directly calls the
.Xr getdevpath 3
function for each supplied device name, translating the device name
to a device path.
.Pp
The
.Fl q
option will generate just the translated output, one per line.
An empty line is generated if the device name could not be translated.
.Pp
The
.Fl r
option will take the translated device name and do a further translation
of it if it is a softlink, returning the contents of the softlink.
.Sh FILES
.Nm
will search the
.Pa /usr/local/etc/devtab ,
.Pa /etc/devtab ,
and
.Pa /etc/defaults/devtab
files for label translations.
.Sh EXAMPLES
.Bd -literal
getdevpath da0

getdevpath /dev/da0

getdevpath serno:ABC123

getdevpath MyDisk
.Ed
.Sh SEE ALSO
.Xr getdevpath 3 ,
.Xr devtab 5 ,
.Xr fstab 5
.Sh HISTORY
The
.Nm
utility appeared in
.Dx 2.3
