DragonFlyBSD/DragonFlyBSD/usr.bin/evtranalyze/evtranalyze.1
.\"-
.\" Copyright (c) 2009 Aggelos Economopoulos
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"
.Dd February 8, 2009
.Dt EVTRANALYZE 1
.Os
.Sh NAME
.Nm evtranalyze
.Nd analyze a trace stream
.Sh SYNOPSIS
.Nm
.Op Fl f Ar infile
.Ar command
.Op Ar argument ...
.Sh DESCRIPTION
The
.Nm
utility is used to analyze an event trace stream.
It takes a few global options, after which the user should
specify a subcommand, followed by the subcommands options.
.Ss Global options
The global options are
.Bl -tag -width indent
.It Fl f Ar path
Specifies the file containing the event stream.
.El
The subcommands are:
.Bl -ohang -width indent
.\" ==== show ====
.It Cm show
Lists the individual events, one per line.
The flags it accepts are:
.Bl -tag -width indent-two
.It Fl f Ar fmt
Limits the displayed events to those matching
.Ar fmt .
.El
.It Cm svg
Generates an svg file ("output.svg") in the current directory,
displaying the stream events.
The flags it accepts are:
.Bl -tag -width indent-two
.It Fl i Ar interval
Limits the displayed events to those occuring within the
specified time interval.
The interval is specified in the form <num>:<num>, where
<num> is given in clock cycles (absolute).
.El
.El
.Sh SEE ALSO
.Xr ktrdump 8
.Sh HISTORY
The
.Nm
utility first appeared in
.Dx 2.5 .
.Sh AUTHORS
.An -nosplit
The
.Nm
utility was implemented by
.An Aggelos Economopoulos Aq aggelos@dragonflybsd.org
for
.Dx .
