DragonFlyBSD/DragonFlyBSD/usr.sbin/i4b/man/i4bq921.4
.\"
.\" Copyright (c) 1997, 1999 Hellmuth Michaelis. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	$Id: i4bq921.4,v 1.8 1999/12/13 22:11:55 hm Exp $
.\"
.\" $FreeBSD: src/usr.sbin/i4b/man/i4bq921.4,v 1.7.2.4 2003/03/13 03:10:59 trhodes Exp $
.\" $DragonFly: src/usr.sbin/i4b/man/i4bq921.4,v 1.4 2007/08/08 01:43:37 swildner Exp $
.\"
.\"	last edit-date: [Mon Dec 13 23:11:55 1999]
.\"
.Dd February 3, 1998
.Dt I4BQ921 4
.Os
.Sh NAME
.Nm i4bq921
.Nd isdn4bsd pseudo device driver handling the Q.921 protocol
.Sh SYNOPSIS
.Cd pseudo-device \&"i4bq921\&"
.Sh DESCRIPTION
.Nm
is the ISDN D channel layer 2 handler.
.Sh SEE ALSO
.Xr i4bq931 4
.Sh STANDARDS
ITU Recommendation Q.920 and Q.921
.Sh AUTHORS
The
.Nm
driver and this manpage were written by
.An Hellmuth Michaelis Aq hm@FreeBSD.org .
