DragonFlyBSD/DragonFlyBSD/usr.sbin/devfsctl/devfsctl.8
.\"
.\" Copyright (c) 2009
.\"	The DragonFly Project.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\"
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in
.\"    the documentation and/or other materials provided with the
.\"    distribution.
.\" 3. Neither the name of The DragonFly Project nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific, prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
.\" LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
.\" FOR A PARTICULAR PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE
.\" COPYRIGHT HOLDERS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
.\" OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd August 12, 2009
.Os
.Dt DEVFSCTL 8
.Sh NAME
.Nm devfsctl
.Nd manipulate devfs rules
.Sh SYNOPSIS
.Nm
.Fl a
.Fl f Ar file
.Op Fl m Ar mount_point
.Nm
.Fl d
.Fl f Ar file
.Nm
.Fl c
.Op Fl m Ar mount_point
.Nm
.Fl r
.Op Fl m Ar mount_point
.Nm
.Fl h
.Sh DESCRIPTION
The
.Nm
provides an interface to manipulate the in-kernel
.Xr devfs 5
ruleset.
.Pp
The options are as follows:
.Bl -tag -width indent
.It Fl a
Load the ruleset specified by
.Fl f
and apply it.
It will not overwrite currently applied rules,
but just append the new ones.
.It Fl c
Clear the current ruleset.
This does not reset the device nodes, but only clear out all stored rules
so that they are not applied to new nodes.
It is therefore recommended to use this command in conjunction with
.Fl r .
.It Fl d
Reads ruleset specified by
.Fl f
and then dumps its contents to stdout.
The rules will not be applied.
This option cannot be used in conjuction with any other option.
It is useful for checking the correct syntax and order of the specified ruleset
and will show the final interpretation as it would be applied.
.It Fl f Ar file
Specifies the file containing the ruleset to be loaded.
See
.Xr devfs.conf 5
for more information on rule syntax.
This option is a requirement for
.Fl a
and
.Fl d .
.It Fl h
Shows a usage message with a short description of
.Nm Ap s
options.
.It Fl m Ar mount_point
Specifies the mount point to which the loaded rules shall apply.
If this option is not specified, the rules will apply to all
.Xr devfs 5
mountpoints.
The
.Ar mount_point
argument does not accept wildcards and must be an absolute path.
.It Fl r
Reset all
.Xr devfs 5
nodes to their original status.
This does not clear the current ruleset and it is hence recommended
to use this command together with
.Fl c .
.El
.Sh FILES
.Bl -tag -width ".Pa /etc/devfs" -compact
.It Pa /etc/devfs
devfs ruleset files
.El
.Sh SEE ALSO
.Xr devfs 5 ,
.Xr devfs.conf 5 ,
.Xr mount_devfs 8
.Sh HISTORY
The
.Nm
utility appeared in
.Dx 2.3 .
.Sh AUTHORS
.An Alex Hornung
