DragonFlyBSD/DragonFlyBSD/sbin/mkinitrd/mkinitrd.8
.\"
.\" Copyright (c) 2010 The DragonFly Project.  All rights reserved.
.\" 
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in
.\"    the documentation and/or other materials provided with the
.\"    distribution.
.\" 3. Neither the name of The DragonFly Project nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific, prior written permission.
.\" 
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
.\" LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
.\" FOR A PARTICULAR PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE
.\" COPYRIGHT HOLDERS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
.\" OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd July 1, 2010
.Os
.Dt MKINITRD 8
.Sh NAME
.Nm mkinitrd
.Nd build an initial ramdisk image for use as early userland
.Sh SYNOPSIS
.Nm
.\".Op Ar options ...
.\".Ar target ...
.Sh DESCRIPTION
The
.Nm
script builds a ramdisk (md) image based on the UFS filesystem containing
only the most basic tools, such as a minimal
.Xr init 8 ,
.Xr sh 1 
as well as many
.Xr mount 8
utilities.
.Pp
It will also copy the contents of 
.Pa /usr/share/initrd
onto the ramdisk, maintaining the same hierarchy.
.Pp
On completion, the final image will be copied to
.Pa /boot/initrd.img ,
ready to be used as an early userland.
.Pp
The
.Nm
script will check for
.Pa /etc/defaults/mkinitrd.conf
and
.Pa /etc/mkinitrd.conf
and include the configuration from these files in the given order, allowing
the user to override or add to the following variables:
.Bd -literal -offset indent
BUILD_DIR
INITRD_SIZE
BIN_TOOLS
SBIN_TOOLS
INITRD_DIRS
CONTENT_DIRS
.Ed
.Pp
Adding the following lines to
.Pa /boot/loader.conf
will enable the use of the created initrd image:
.Bd -literal -offset indent
initrd.img_load="YES"
initrd.img_type="md_image"
vfs.root.mountfrom="ufs:md0s0"
.Ed
.Sh SEE ALSO
.Xr md 4 ,
.Xr loader.conf 5
