DragonFlyBSD/DragonFlyBSD/sbin/vquota/vquota.8
.\" Copyright (c) 2011,2012 François Tigeot
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd March 28, 2012
.Dt VQUOTA 8
.Os
.Sh NAME
.Nm vquota
.Nd VFS quota system utility
.
.Sh SYNOPSIS
.Nm
.Oo
.Fl D | h
.Oc
.Ar command
.Ar argument
.Sh DESCRIPTION
This manual page documents the
.Nm
utility which provides functions for managing virtual file system
accounting and quotas.
.Pp
To use the
.Nm
utility, the
.Va vfs.quota_enabled
tunable needs to be set in
.Xr loader.conf 5 .
.Pp
The following options are available:
.Bl -tag -width Ds
.It Fl D
Debug flag, show raw messages sent to and received from kernel
.It Fl h
"Human-readable" output. Use unit suffixes: Byte, Kilobyte, Megabyte,
Gigabyte, Terabyte and Petabyte in order to reduce the number of
digits to four or fewer.
.It Fl n
Show raw user and group ids. Normally
.Nm
attempts to resolve and display full user and group names.
.El
.Pp
The commands are as follows:
.Bl -tag -width indent
.\" ==== check ====
.It Cm check Ar directory
Reports the space (in bytes) occupied by files names located in the
directory hierarchy present under
.Ar directory .
.
.\" ==== lsfs ====
.It Cm lsfs
List mounted file systems having space accounting enabled
.
.\" ==== show ====
.It Cm show Ar mount_point
Show file size usage and quota limits for the file system mounted under
.Ar mount_point .
The information is broken down by uid and gid and is expressed by default
in bytes.
.
.\" ==== sync ====
.It Cm sync Ar mount_point
Initialize in one go the usage counters for the filesystem
mounted under
.Ar mount_point
with real usage data. This command scans an entire filesystem
directory hierarchy and may be slow to run
.\" ==== limit ====
.It Cm limit Ar mount_point size
Set a global quota of
.Ar size
bytes for the filesystem mounted under
.Ar mount_point .
.\" ==== ulim ====
.It Cm ulim Ar mount_point user size
Set a quota of
.Ar size
bytes for the filesystem mounted under
.Ar mount_point
and the specified
.Ar user .
.\" ==== glim ====
.It Cm glim Ar mount_point group size
Set a quota of
.Ar size
bytes for the filesystem mounted under
.Ar mount_point
and the specified
.Ar group .
.El
.Pp
A limit of 0 effectively means checks are disabled.
.
.Sh EXAMPLES
The following is an example of a typical usage
of the
.Nm
command:
.Pp
.Dl "vquota show /mnt/data"
.
.Sh SEE ALSO
.Xr vquotactl 2 ,
.Xr loader.conf 5
.Sh HISTORY
The
.Nm
utility first appeared in
.Dx 2.13 .
.Sh AUTHORS
.An Francois Tigeot Aq Mt ftigeot@wolfpond.org
