DragonFlyBSD/DragonFlyBSD/usr.sbin/sshlockout/sshlockout.8
.\" Copyright (c) 2015 The DragonFly Project.  All rights reserved.
.\"
.\" This code is derived from software contributed to The DragonFly Project
.\" by Matthew Dillon <dillon@backplane.com>
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\"
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in
.\"    the documentation and/or other materials provided with the
.\"    distribution.
.\" 3. Neither the name of The DragonFly Project nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific, prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
.\" LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
.\" FOR A PARTICULAR PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE
.\" COPYRIGHT HOLDERS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
.\" OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd September 13, 2017
.Dt SSHLOCKOUT 8
.Os
.Sh NAME
.Nm sshlockout
.Nd utility to block port 22 on preauth failures
.Sh SYNOPSIS
.Bd -literal
#
# pf(4) configuration.
#

# in /etc/pf.conf
#
table <lockout> persist { }

# and later in /etc/pf.conf - see below
#
block in quick on $ext_if proto tcp from <lockout> to any port 22

# in /etc/syslog.conf
#
auth.info;authpriv.info          |exec /usr/sbin/sshlockout -pf "lockout"

# in root's crontab
#
3 3 * * *       pfctl -tlockout -T expire 86400

#
# ipfw(8) configuration.
#
ipfw table 0 create
ipfw add deny ip from '<0>' to any

# in /etc/syslog.conf
#
auth.info;authpriv.info         |exec /usr/sbin/sshlockout -ipfwtbl 0

# in root's crontab
#
3 3 * * *       ipfw -fq table 0 expire 86400
.Ed
.Sh DESCRIPTION
This program is generally installed in
.Pa /etc/syslog.conf
as a pipe to parse the
.Xr sshd 8
demons error log in realtime.
In addition, a root crontab entry should generally be created to clean
out stale entries in the
.Xr pf 4
or
.Xr ipfw 8
.Ar table
at least once a day.
Using expire instead of flush will maintain a rolling window of locked out
IPs.
The
.Xr pf 4
or
.Xr ipfw 8
module must be loaded and running with the table and rules properly
configured.
.Pp
This program will monitor the ssh syslog output and keep track of attempts
to login to unknown users as well as preauth failures.
If 5 attempts fail in any one hour period, a permanent entry is added to the
.Xr pf 4
or
.Xr ipfw 8
.Ar table
for the associated IP address.
You still have to add a rule to
.Xr pf.conf 5
or use
.Xr ipfw 8
to block IP addresses listed in this table.
The cron entry you create cleans the block list out typically once a day.
.Pp
This program generally limits brute-force attempts to break into a machine
via ssh.
.Pp
When setting up the
.Xr pf 4
or
.Xr ipfw 8
rules,
note that the table will be filled based on failed ssh connections destined
to that particular machine.
If the machine is acting as a router you can decide whether you want the
.Xr pf 4
or
.Xr ipfw 8
rule to lockout that suspect IP to just the machine,
or to everything it routes to.
We usually recommend an unconditional blocking rule.
.Sh NOTICE
This program is still a work in progress.
.Sh SEE ALSO
.Xr ssh 1 ,
.Xr pf 4 ,
.Xr syslog.conf 5 ,
.Xr ipfw 8 ,
.Xr sshd 8
.Sh HISTORY
The
.Nm
utility first appeared in
.Dx 4.1 .
.Sh AUTHORS
.An Matthew Dillon Aq Mt dillon@backplane.com
