DragonFlyBSD/DragonFlyBSD/sbin/mount_autofs/mount_autofs.8
.\" Copyright (c) 2018 The DragonFly Project
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHORS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHORS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd January 22, 2018
.Dt MOUNT_AUTOFS 8
.Os
.Sh NAME
.Nm mount_autofs
.Nd mount autofs
.Sh SYNOPSIS
.Nm
.Op Fl f Ar from
.Op Fl o Ar options
.Op Fl O Ar master_options
.Op Fl p Ar master_prefix
.Ar autofs
.Ar mount_point
.Sh DESCRIPTION
The
.Nm
command is ported from
.Nx .
This is intended to be a low level mount command for
.Xr autofs 5 .
.Pp
Note that
.Xr autofs 5
is mountable using
.Xr automount 8
which incorporates
.Xr auto_master 5
parser, without having to specify
.Xr autofs 5
mount options via command line.
.\" and that was the original intention of FreeBSD/autofs.
.\" This is a low level version without auto_master(5) involved.
.Sh SEE ALSO
.Xr autofs 5 ,
.Xr auto_master 5 ,
.Xr automount 8 ,
.Xr fstab 5 ,
.Xr mount 8
.Sh HISTORY
The
.Nm
utility first appeared in
.Nx 9.0 .
The
.Nm
utility first appeared in
.Dx 5.1 .
.Sh BUGS
This page was created because otherwise compilation fails.
