DragonFlyBSD/DragonFlyBSD/sbin/mount_autofs/mount_autofs.8
.\" Copyright (c) 2018 The DragonFly Project
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHORS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHORS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd November 22, 2019
.Dt MOUNT_AUTOFS 8
.Os
.Sh NAME
.Nm mount_autofs
.Nd mount autofs
.Sh SYNOPSIS
.Nm
.Op Fl f Ar from
.Op Fl o Ar options
.Op Fl O Ar master_options
.Op Fl p Ar master_prefix
.Ar autofs
.Ar mount_point
.Sh DESCRIPTION
The
.Nm
command is ported from
.Nx .
This is intended to be a low level mount command for
.Xr autofs 5 .
.Pp
The
.Nm
command should not usually be called by admins.
Use
.Xr automount 8
instead.
.Xr autofs 5
is mountable using
.Xr automount 8 ,
which incorporates an
.Xr auto_master 5
parser, without having to specify
.Xr autofs 5
mount options via command line.
.\" and that was the original intention of FreeBSD/autofs.
.\" This is a low level version without auto_master(5) involved.
.Pp
The
.Nm
command attaches the automounter filesystem on the
.Ar autofs
device on to the file system tree at point
.Ar mount_point .
Both
.Ar autofs
and
.Ar mount_point
are converted to absolute paths before use.
.Pp
This command is normally executed by
.Xr automount 8 .
The options are as follows:
.Bl -tag -width Ds
.It Fl f
Set the
.Ar from
location for
.Xr autofs 5 .
This argument is usually read from
.Pa /etc/auto_master
by
.Xr automount 8 .
.It Fl o
Set the mount options.
See the
.Xr mount 8
man page for possible options and their meanings.
.It Fl O
Set the
.Xr autofs 5
options.
See the
.Op Fl Ar options
in
.Sx AUTO_MASTER SYNTAX
of
.Xr auto_master 5 .
.It Fl p
Set the
.Xr autofs 5
prefix, below which the file system(s) will be mounted.
.Pp
.Sh SEE ALSO
.Xr autofs 5 ,
.Xr auto_master 5 ,
.Xr fstab 5 ,
.Xr automount 8 ,
.Xr mount 8
.Sh HISTORY
The
.Nm
utility first appeared in
.Nx 9.0 .
The
.Nm
utility first appeared in
.Dx 5.1 .
