DragonFlyBSD/DragonFlyBSD/usr.bin/wmake/wmake.1
.\"
.\" Copyright (c) 2006 The DragonFly Project.  All rights reserved.
.\" 
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in
.\"    the documentation and/or other materials provided with the
.\"    distribution.
.\" 3. Neither the name of The DragonFly Project nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific, prior written permission.
.\" 
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
.\" LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
.\" FOR A PARTICULAR PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE
.\" COPYRIGHT HOLDERS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
.\" OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd February 7, 2011
.Dt WMAKE 1
.Os
.Sh NAME
.Nm wmake
.Nd build DragonFly source in a buildworld environment
.Sh SYNOPSIS
.Nm
.Op Ar options ...
.Ar target ...
.Sh DESCRIPTION
The
.Nm
script allows you to build any element within the
.Dx
source tree
using a buildworld environment.
It is extremely useful for debugging or
development work.
Instead of having to restart the buildworld (even with
.Fl DNOCLEAN
and
.Fl DNOTOOLS
it can take a while) this script can be used to immediately build
whatever piece of the world you are working on.
.Pp
The
.Nm
utility will accept all options and arguments that
.Xr make 1
accepts.
.Pp
To install things built with
.Nm ,
use:
.Bd -literal
$ wmake install INSTALL=install DESTDIR=/
.Ed
.Sh SEE ALSO
.Xr make 1 ,
.Xr build 7
