DragonFlyBSD/DragonFlyBSD/sbin/newfs_hammer/newfs_hammer.8
.\" Copyright (c) 2007 The DragonFly Project.  All rights reserved.
.\" 
.\" This code is derived from software contributed to The DragonFly Project
.\" by Matthew Dillon <dillon@backplane.com>
.\" 
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in
.\"    the documentation and/or other materials provided with the
.\"    distribution.
.\" 3. Neither the name of The DragonFly Project nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific, prior written permission.
.\" 
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
.\" LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
.\" FOR A PARTICULAR PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE
.\" COPYRIGHT HOLDERS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
.\" OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\" 
.\" $DragonFly: src/sbin/newfs_hammer/newfs_hammer.8,v 1.2 2007/11/01 22:26:37 dillon Exp $
.Dd September 10, 2007
.Dt NEWFS_HAMMER 8
.Os
.Sh NAME
.Nm newfs_hammer
.Nd construct a new HAMMER file system
.Sh SYNOPSIS
.Nm
.Fl L Ar label
.Op Fl c Ar clusize
.Op Fl S
.Op Fl U Ar uuid
.Ar special
.Op special...
.Sh DESCRIPTION
The
.Nm
utility creates a HAMMER filesystem on device
.Ar special .
If multiple devices are specified a single HAMMER filesystem is created
which spans all of them.  HAMMER filesystems are sector-size agnostic,
however the
.DX
implementation requires the sector size to be no larger then 16K.
HAMMER filesystems start at a relative offset of 0 and may only be created
under out-of-band disk labels (disklabel64 or gpt labels), or in standard
disklabel partitions which do not overlap the label area.
.Pp
The options are as follow:
.Bl -tag -width indent
.It Fl L Ar label
All HAMMER filesystems must be named and names should be unique on a
per-machine basis.
.It Fl U Ar uuid
All HAMMER filesystems are assigned a globally unique UUID.  If no UUID
is specified one will be synthesized.
.It Fl S
Force the HAMMER filesystem to be formatted with a supercluster layer,
allowing it to support volumes greater then 2TB.  This option is automatically
enabled if formatting HAMMER on a large disk.
.It Fl c Ar clusize
HAMMER organizes file objects in clusters and supeclusters.  Clusters
default to the maximum size, which is 64MB.  A smaller size may be chosen
if desired.  This option is not recommended.  HAMMER will use a truncated
cluster as the last cluster and still use all available disk space
regardless of the cluster size.
.El
.Sh NOTES
.Sh EXAMPLES
.Bd -literal -offset indent
newfs_hammer -L Home /dev/ad0s1d
.Ed
.Pp
Create a file system named 'Home' on
.Pa /dev/ad0s1d .
.Sh DIAGNOSTICS
Exit status is 0 on success and 1 on error.
.Sh SEE ALSO
.Xr disklabel 8 ,
.Xr fdisk 8 ,
.Xr newfs 8
.Sh HISTORY
The
.Nm
utility first appeared in
.Dx 2.0 .
.Sh AUTHORS
.An Matthew Dillon Aq dillon@backplane.com .
