DragonFlyBSD/DragonFlyBSD/usr.sbin/dschedctl/dschedctl.8
.\"
.\" Copyright (c) 2010
.\"	The DragonFly Project.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\"
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in
.\"    the documentation and/or other materials provided with the
.\"    distribution.
.\" 3. Neither the name of The DragonFly Project nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific, prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
.\" LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
.\" FOR A PARTICULAR PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE
.\" COPYRIGHT HOLDERS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
.\" OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd April 20, 2010
.Os
.Dt DSCHEDCTL 8
.Sh NAME
.Nm dschedctl
.Nd manipulate disk policies
.Sh SYNOPSIS
.Nm
.Fl l
.Op Ar disk
.Nm
.Fl p
.Nm
.Op Fl v
.Fl s Ar policy
.Op Ar disk
.Nm
.Fl h
.Sh DESCRIPTION
The
.Nm
provides an interface to manipulate the in-kernel
disk scheduler framework.
.Pp
The options are as follows:
.Bl -tag -width indent
.It Fl h
Shows a usage message with a short description of
.Nm Ap s
options.
.It Fl l Op Ar disk
If
.Ar disk
is specified, the policy currently assigned to
.Ar disk
is shown.
Otherwise all disks and their respective policies are shown.
.It Fl p
List all available dsched policies.
Any of these policies can be set on any disk.
.It Fl s Ar policy Op Ar disk
Sets the dsched policy of
.Ar disk
if specified, or all disks if not, to
.Ar policy .
If the verbose mode is enabled, a message will be printed for each successful
policy change.
.It Fl v
Enables verbose mode.
.El
.Sh HISTORY
The
.Nm
utility appeared in
.Dx 2.7 .
.Sh AUTHORS
.An Alex Hornung
