DragonFlyBSD/DragonFlyBSD/sbin/mount_dirfs/mount_dirfs.8
.\"
.\" Copyright (c) 2013 Antonio Huete Jimenez <tuxillo@quantumachine.net>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd September 5, 2013
.Dt MOUNT_DIRFS 8
.Os
.Sh NAME
.Nm mount_dirfs
.Nd mount an host directory inside a vkernel
.Sh SYNOPSIS
.Nm
.Op Fl o Ar options
.Ar hostdir
.Ar mount_point
.Sh DESCRIPTION
The
.Nm
allows
.Xr vkernel 7
to access host directories with minimal configuration.
.Pp
The following options are supported:
.Bl -tag -width XoXoptions
.It Fl o Ar options
Options are specified with a
.Fl o
flag followed by a comma-separated string of options.
See the
.Xr mount 8
and
.Xr dirfs 5
man page for possible options and their meanings.
.El
.Sh EXAMPLES
The command below mounts host directory
.Pa /usr/src
on vkernel's directory
.Pa /mnt :
.Pp
.Ic "mount -t dirfs /usr/src /mnt"
.Sh SEE ALSO
.Xr dirfs 5 ,
.Xr fstab 5 ,
.Xr mount 8
