DragonFlyBSD/DragonFlyBSD/usr.sbin/802_11/wpa_passphrase/wpa_passphrase.8
.\" Copyright (c) 2006 Henrik Brix Andersen <henrik@brixandersen.dk>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD: head/usr.sbin/wpa/wpa_passphrase/wpa_passphrase.8 195644 2009-07-12 19:58:52Z sam $
.\"
.Dd May 21, 2020
.Dt WPA_PASSPHRASE 8
.Os
.Sh NAME
.Nm wpa_passphrase
.Nd utility for generating a 256-bit pre-shared WPA key from
an ASCII passphrase
.Sh SYNOPSIS
.Nm
.Aq Ar ssid
.Op Ar passphrase
.Sh DESCRIPTION
.Nm
pre-computes PSK entries for network configuration blocks of a
.Xr wpa_supplicant.conf 5
file. An ASCII passphrase and SSID are used to generate a 256-bit PSK.
.Sh OPTIONS
.Bl -tag -width indent
.It Ic ssid
The SSID whose passphrase should be derived.
.It Ic passphrase
The passphrase to use. If not included on the command line,
passphrase will be read from standard input.
.Sh "SEE ALSO"
.Pp
.Xr wpa_supplicant.conf 5 ,
.Xr wpa_supplicant 8
.Sh AUTHORS
.Pp
wpa_supplicant is copyright (c) 2003-2019,
Jouni Malinen <j@w1.fi> and
contributors.
All Rights Reserved.
.Pp
This program is licensed under the BSD license (the one with
advertisement clause removed).
