DragonFlyBSD/DragonFlyBSD/share/man/man5/mailer.conf.5
.\"	$NetBSD: mailer.conf.5,v 1.2 1999/05/29 18:18:30 christos Exp $
.\"	$FreeBSD: src/share/man/man5/mailer.conf.5,v 1.1.1.1.2.5 2001/08/17 13:08:47 ru Exp $
.\"
.\" Copyright (c) 1998
.\" 	Perry E. Metzger.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgment:
.\"	This product includes software developed for the NetBSD Project
.\"	by Perry E. Metzger.
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" The following requests are required for all man pages.
.Dd March 9, 2015
.Dt MAILER.CONF 5
.Os
.Sh NAME
.Nm mailer.conf
.Nd configuration file for
.Xr mailwrapper 8
.Sh DESCRIPTION
The file
.Pa /etc/mail/mailer.conf
contains a series of pairs. The first member of each pair is the name
of a program invoking
.Xr mailwrapper 8
which is typically a symbolic link to
.Pa /usr/sbin/sendmail .
(On a typical system,
.Xr newaliases 1
and
.Xr mailq 1
would be set up this way.)
The second member of each pair is the name of the program to
actually execute when the first name is invoked. The file may also
contain comments, denoted by a # mark in the first column of any line.
.Sh FILES
/etc/mail/mailer.conf
.Sh EXAMPLES
The following is an example of how to set up an
.Nm
for traditional sendmail invocation behavior (installed from DPorts)
.Bd -literal
# Use sendmail as Mail Transfer Agent
sendmail	/usr/local/sbin/sendmail
mailq		/usr/local/bin/mailq
newaliases	/usr/local/bin/newaliases
hoststat	/usr/local/bin/hoststat
purgestat	/usr/local/bin/purgestat
.Ed
.Pp
This example shows how to invoke a sendmail-workalike like Postfix
installed from DPorts to replace
.Xr dma 8
.Bd -literal
# Use postfix as Mail Transfer Agent
sendmail	/usr/local/sbin/sendmail
mailq		/usr/local/bin/mailq
newaliases	/usr/local/bin/newaliases
hoststat	true
purgestat	true
.Ed
.Pp
This example shows how to invoke a sendmail-workalike like OpenSMTPd
installed from DPorts to replace
.Xr dma 8
.Bd -literal
# Use opensmtpd as Mail Transfer Agent
sendmail	/usr/local/sbin/smtpctl
mailq		/usr/local/sbin/smtpctl
newaliases	/usr/local/sbin/smtpctl
hoststat	true
purgestat	true
.Ed
.Pp
These are the default contents of the file
.Bd -literal
# Use dma as Mail Transfer Agent
sendmail	/usr/libexec/dma
mailq		/usr/libexec/dma
newaliases	true
hoststat	true
purgestat	true
.Ed
.Sh SEE ALSO
.Xr mail 1 ,
.Xr mailwrapper 8
.Sh HISTORY
.Nm
appeared in
.Nx 1.4 .
.Sh AUTHORS
.An Perry E. Metzger Aq Mt perry@piermont.com
should go away.
