DragonFlyBSD/DragonFlyBSD/share/man/man5/manpath.config.5
.\"
.\" Copyright (c) 2007
.\"	The DragonFly Project.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\"
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in
.\"    the documentation and/or other materials provided with the
.\"    distribution.
.\" 3. Neither the name of The DragonFly Project nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific, prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
.\" LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
.\" FOR A PARTICULAR PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE
.\" COPYRIGHT HOLDERS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
.\" OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd April 25, 2007
.Dt MANPATH.CONFIG 5
.Os
.Sh NAME
.Nm manpath.config
.Nd manual page search path configuration file
.Sh SYNOPSIS
.Pa /etc/manpath.config
.Sh DESCRIPTION
The
.Nm
file configures the manual page search path used by the man utilities.
The environment variable
.Ev MANPATH
(if set) overrides this information.
.Pp
Empty lines or lines beginning with a
.Dq #
are ignored.
The following keywords are recognized:
.Bl -tag -width XXXXXX
.It Li MANDATORY_MANPATH Ar manpath_element
Each specified
.Ar manpath_element
will be added to the search path.
.It Li OPTIONAL_MANPATH Ar manpath_element
Each specified
.Ar manpath_element
will be added to the search path if it exists.
.It Li MANPATH_MAP Ar path_element Ar manpath_element
Each specified
.Ar manpath_element
will be added to the search path if
.Ar path_element
is in
.Ev PATH .
.\".It MANLOCALES Ar locale1 Ar locale2 Ar ...
.El
.Sh FILES
.Bl -tag -width ".Pa /etc/manpath.config" -compact
.It Pa /etc/manpath.config
Configuration file for setting up the manual page search path.
.El
.Sh SEE ALSO
.Xr manpath 1
.Sh AUTHORS
This manual page was written by
.An Sascha Wildner .
