DragonFlyBSD/DragonFlyBSD/share/man/man5/resident.conf.5
.\"
.\" Copyright (c) 2007
.\"	The DragonFly Project.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\"
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in
.\"    the documentation and/or other materials provided with the
.\"    distribution.
.\" 3. Neither the name of The DragonFly Project nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific, prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
.\" LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
.\" FOR A PARTICULAR PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE
.\" COPYRIGHT HOLDERS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
.\" OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd May 9, 2007
.Dt RESIDENT.CONF 5
.Os
.Sh NAME
.Nm resident.conf
.Nd list of dynamic binaries to make resident
.Sh SYNOPSIS
.Pa /etc/resident.conf
.Sh DESCRIPTION
The
.Nm
file specifies a list of binaries to make resident using
.Xr resident 8 .
Wildcards are allowed and empty lines or lines beginning with a
.Dq #
are ignored.
.Pp
Processing of
.Nm
is activated by setting
.Va resident_enable
in
.Pa /etc/rc.conf .
.Sh FILES
.Bl -tag -width ".Pa /etc/resident.conf" -compact
.It Pa /etc/resident.conf
configuration file for specifying binaries to make resident
.El
.Sh SEE ALSO
.Xr rc.conf 5 ,
.Xr resident 8
.Sh AUTHORS
This manual page was written by
.An Sascha Wildner .
