DragonFlyBSD/DragonFlyBSD/share/man/man5/tmpfs.5
.\"
.\" Copyright (c) 2007 Xin LI
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS DOCUMENTATION IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD: src/share/man/man5/tmpfs.5,v 1.7 2010/01/29 15:11:50 jh Exp $
.\"
.Dd February 2, 2010
.Dt TMPFS 5
.Os
.Sh NAME
.Nm tmpfs
.Nd "efficient memory file system"
.Sh SYNOPSIS
To compile this driver into the kernel,
place the following line in your
kernel configuration file:
.Bd -ragged -offset indent
.Cd "options TMPFS"
.Ed
.Pp
Alternatively, to load the driver as a
module at boot time, place the following line in
.Xr loader.conf 5 :
.Bd -literal -offset indent
tmpfs_load="YES"
.Ed
.Sh DESCRIPTION
The
.Nm
driver will permit the
.Dx
kernel to access
.Tn tmpfs
file systems.
.Sh OPTIONS
The following options are available when
mounting
.Nm
file systems:
.Bl -tag -width indent
.It Cm gid
root group id.
.It Cm uid
root user id.
.It Cm mode
permissions in octal format.
.It Cm inodes
maximum number of inodes.
.It Cm size
maximum size (in bytes) for the file system.
.It Cm maxfilesize
maximum file size (in bytes).
.El
.Sh EXAMPLES
To mount a
.Nm
memory file system:
.Pp
.Dl "mount -t tmpfs tmpfs /tmp"
.Sh SEE ALSO
.Xr nmount 2 ,
.Xr unmount 2 ,
.Xr fstab 5 ,
.Xr mount 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Dx 2.5.1 .
.Sh AUTHORS
.An -nosplit
The
.Nm
kernel implementation was written by
.An Julio M. Merino Vidal Aq jmmv@NetBSD.org
as a Google SoC project.
.Pp
.An Rohit Jalan
and others ported it from
.Nx
to
.Fx .
.Pp
.An Naoya Sugioka
and others ported it from
.Nx
to
.Dx .
.Pp
This manual page was written by
.An Xin LI Aq delphij@FreeBSD.org .
.Sh BUGS
The
.Nm
kernel implementation is currently considered as
an experimental feature.
Some file system mount
time options are not well supported.
