DragonFlyBSD/DragonFlyBSD/sbin/mount_devfs/mount_devfs.8
.\"
.\" Copyright (c) 2009
.\"	The DragonFly Project.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\"
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in
.\"    the documentation and/or other materials provided with the
.\"    distribution.
.\" 3. Neither the name of The DragonFly Project nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific, prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
.\" LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
.\" FOR A PARTICULAR PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE
.\" COPYRIGHT HOLDERS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
.\" OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd December 4, 2019
.Dt MOUNT_DEVFS 8
.Os
.Sh NAME
.Nm mount_devfs
.Nd mount a device file system
.Sh SYNOPSIS
.Nm
.Op Fl o Ar options
.Ar node
.Sh DESCRIPTION
The
.Nm
command attaches an instance of the device file system (or
.Xr devfs 5 )
to the global file system namespace.
This command is automatically executed for
.Pa /dev
at boot time.
.Pp
The options are as follows:
.Bl -tag -width indent
.It Fl o
Specify mount options, which are a comma delimited set of options (see
.Xr mount 8 ) .
Supported mount options are:
.Bl -tag -width indent
.It Ar jail
Mount
.Xr devfs 5
for a jail.
Only rules between
.Ic jail Ar yes
and
.Ic jail Ar no
are applied.
.It Ar ruleset=rule_file
When mounting, apply the rules from the specified
.Ar rule_file ,
which can be either an absolute path or one relative to
.Pa /etc/devfs/ .
.El
.El
.Pp
Mounting an already mounted
.Ar node
clears and resets all rules that are in effect for it and (if a
.Ar ruleset
option is present) applies the rules from
.Ar rule_file .
It is equal to
.Nm devfsctl Fl cr
followed by an optional
.Nm devfsctl Fl af .
.Sh EXAMPLES
Mount a
.Xr devfs 5 ,
marked as
.Ar jail ,
with a ruleset file named
.Pa default.rules
onto
.Pa /var/jail/dev .
.Bd -literal -offset indent
mount_devfs -o jail,ruleset=default.rules /var/jail/dev
.Ed
.Pp
A corresponding
.Xr fstab 5
entry is:
.Bd -literal -offset indent
devfs /var/jail/dev devfs ro,jail,ruleset=default.rules
.Ed
.Sh SEE ALSO
.Xr mount 2 ,
.Xr unmount 2 ,
.Xr devfs 5 ,
.Xr fstab 5 ,
.Xr devfsctl 8 ,
.Xr mount 8
.Sh HISTORY
The
.Nm
utility first appeared in
.Dx 2.3 .
