DragonFlyBSD/DragonFlyBSD/share/man/man4/man4.i386/sbni.4
.\" Written by Denis I. Timofeev, 2002.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD: src/share/man/man4/man4.i386/sbni.4,v 1.1.2.1 2003/04/15 17:23:32 fjoe Exp $
.\"
.Dd January 8, 2002
.Dt SBNI 4 i386
.Os
.Sh NAME
.Nm sbni
.Nd Granch SBNI12 leased line modem driver
.Sh SYNOPSIS
.Cd "device sbni"
.Sh DESCRIPTION
The
.Nm
driver provides support for leased line modems of following models:
.Pp
.Bl -tag -compact -width ".Pa SBNI12-10, SBNI12D-10, PCI"
.It Pa SBNI12-05, SBNI12D-05, PCI
.It Pa SBNI12-10, SBNI12D-10, PCI
.El
.Pp
and a kit for data link over a voice band
SBNI12-11, SBNI12D-11, PCI.
.Sh FILES
The sources for the driver reside in:
.Pp
.Bl -tag -compact -width ".Pa /sys/dev/netif/sbni/if_sbnireg.h"
.It Pa /sys/dev/netif/sbni/if_sbni.c
.It Pa /sys/dev/netif/sbni/if_sbnireg.h
.It Pa /sys/dev/netif/sbni/if_sbnivar.h
.El
.Sh SEE ALSO
.Xr arp 4 ,
.Xr netintro 4 ,
.Xr ifconfig 8
.Sh HISTORY
The
.Nm
device driver first appeared in
.Fx 4.6 .
.Sh AUTHORS
The
.Nm
device driver for
.Fx
4.x was written by Denis I. Timofeev, partially
based on David Greenman's
.Nm ed
driver. Earlier versions (available on ftp.granch.com) were written by
Alexey V. Zverev.
.Pp
SBNI12 hardware was designed by Alexey V. Chirkov.
