DragonFlyBSD/DragonFlyBSD/usr.sbin/efisetup/efisetup.8
.\" Copyright (c) 2017 Matthew Dillon, All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd September 15, 2026
.Dt EFISETUP 8
.Os
.Sh NAME
.Nm efisetup
.Nd Create a complete UEFI install on a fresh drive
.Sh SYNOPSIS
.Nm
.Op Fl s Ar swapsize{m,g}
.Op Fl S Ar serialno
.Ar drive
.Sh DESCRIPTION
This program will create a fresh UEFI install of
.Dx
on a drive.
The drive will be completely reformatted and any prior contents will be
lost!
.Bl -tag -width 20m
.It Fl s Ar swapsize{m,g}
Specify the size of the swap partition, default is "8g".
.It Fl S Ar serialno
Specify the serial number of the device as it would appear
under
.Pa /dev/serno/* .
In most cases this is simply the reported serial number, however note that the
.Xr nvme 4
driver will tack on a namespace id to the reported serial number,
typically "-1".
Only specify the serial number, do not specify a path prefix.
If you use this option the script will install path references in fstab
and so forth using the
.Pa serno/
path.
If you do not use this option, the drive name will be used instead.
We recommend using this option.
.It Ar drive
Specify the drive, for example "nvme0".
You may omit the
.Pa /dev/
prefix if you wish.
The raw drive should be specified, do not specify a
.Pa serno/
path here.
.El
.Sh USAGE
.Nm
expects you to have completed a buildworld and buildkernel
sequence before running the program, see
.Xr build 7
for more information on how to build a fresh system.
.Pp
.Nm
will create a fresh GPT slice table with two slices,
install the required EFI boot files on slice 0, and
install a
.Dx
64-bit disklabel on slice 1.
The program creates a UFS boot partition
.Ql a ,
a swap partition
.Ql b ,
and a HAMMER2 system partition
.Ql d
inside the disklabel.
The UFS partition is mounted at
.Pa /boot
in the installed system.
This is the separate UFS boot layout, not a GPT whole-partition HAMMER2
BOOT PFS installation.
.Pp
The ESP executable is copied from the running system's
.Pa /boot/loader.efi
to
.Pa /EFI/BOOT/BOOTX64.EFI .
The script subsequently installs the world and kernel in the target
filesystems.
Ensure the source EFI executable is the version intended for the new
installation.
.Pp
After the world and kernel are installed,
.Nm
will make adjustments to the target
.Pa /boot/loader.conf ,
.Pa /etc/fstab ,
and
.Pa /etc/rc.conf
with the appropriate disk paths, then unmount.
.Pp
After completion of the operation you should be able to boot from the
drive and then finish up your adjustments to
.Pa /etc/rc.conf
to get the network up and so forth.
This script does only a very basic installation.
For a more substantial initial installation you should boot from a
.Dx
install image and select an EFI installation.
.Sh SEE ALSO
.Xr loader 8 ,
.Xr uefi 8
.Sh HISTORY
The
.Nm
utility appeared in
.Dx 4.8 .
.Sh CAVEATS
.Nm
is a fresh-drive installation tool, not an updater for an existing ESP.
It reformats the target drive.
To update an installed EFI executable without repartitioning, see
.Xr uefi 8 .
