DragonFlyBSD/DragonFlyBSD/usr.sbin/fstyp/fstyp.8
.\" Copyright (c) 2016 The DragonFly Project
.\" Copyright (c) 2014 The FreeBSD Foundation
.\" All rights reserved.
.\"
.\" This software was developed by Edward Tomasz Napierala under sponsorship
.\" from the FreeBSD Foundation.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHORS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHORS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd April 14, 2016
.Dt FSTYP 8
.Os
.Sh NAME
.Nm fstyp
.Nd determine filesystem type
.Sh SYNOPSIS
.Nm
.Op Fl l
.Op Fl s
.Op Fl u
.Ar special
.Sh DESCRIPTION
The
.Nm
utility is used to determine the filesystem type on a given device.
It can recognize ISO-9660, Ext2, FAT, NTFS, UFS, and HAMMER filesystems.
When the
.Fl u
flag is specified,
.Nm
also recognizes certain additional metadata formats that cannot be
handled using
.Xr mount 8 .
.Pp
The filesystem name is printed to the standard output
as, respectively:
.Bl -item -offset indent -compact
.It
cd9660
.It
ext2fs
.It
msdosfs
.It
ntfs
.It
ufs
.It
hammer
.El
.Pp
Note that HAMMER filesystem consists of more than one volumes requires a path in blkdevs format.
See
.Xr hammer 8
for blkdevs format.
.Nm
doesn't recognize partially specified block devices as HAMMER filesystem volumes unless
.Fl u
flag is specified.
.Pp
Because
.Nm
is built specifically to detect filesystem types, it differs from
.Xr file 1
in several ways.
The output is machine-parsable, filesystem labels are supported,
and does not try to recognize any file format other than filesystems.
.Pp
These options are available:
.Bl -tag -width ".Fl l"
.It Fl l
In addition to filesystem type, print filesystem label if available.
.It Fl s
Ignore file type.
By default,
.Nm
only works on regular files and disk-like device nodes.
Trying to read other file types might have unexpected consequences or hang
indefinitely.
.It Fl u
Include filesystems and devices that cannot be mounted directly by
.Xr mount 8 .
.El
.Sh EXIT STATUS
The
.Nm
utility exits 0 on success, and >0 if an error occurs or the filesystem
type is not recognized.
.Sh SEE ALSO
.Xr file 1 ,
.Xr autofs 5 ,
.Xr mount 8 ,
.Xr hammer 8
.Sh HISTORY
The
.Nm
command appeared in
.Fx 10.2 .
The
.Nm
command appeared in
.Dx 4.5 .
.Sh AUTHORS
The
.Nm
utility was developed by
.An Edward Tomasz Napierala Aq Mt trasz@FreeBSD.org
under sponsorship from the FreeBSD Foundation.
ZFS and GELI support was added by
.An Allan Jude Aq Mt allanjude@FreeBSD.org
.Pp
The
.Nm
utility was ported to
.Dx
by
.An Tomohiro Kusumi Aq Mt kusumi.tomohiro@gmail.com .
.Sh BUGS
The
.Nm
utility on
.Dx
currently doesn't support
.Xr zfs 8
pool and
.Xr geli 8
providers supported on
.Fx .
