DragonFlyBSD/DragonFlyBSD/usr.bin/ktrdump/ktrdump.8
.\"-
.\" Copyright (c) 2002 Chad David
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD: src/usr.bin/ktrdump/ktrdump.8,v 1.7 2005/03/08 06:58:56 hmp Exp $
.\" $DragonFly: src/usr.bin/ktrdump/ktrdump.8,v 1.5 2005/12/06 23:41:56 dillon Exp $
.\"
.Dd May 5, 2004
.Dt KTRDUMP 8
.Os
.Sh NAME
.Nm ktrdump
.Nd print kernel ktr trace buffer
.Sh SYNOPSIS
.Nm
.Op Fl acfinpqrstx
.Op Fl N Ar execfile
.Op Fl M Ar corefile
.Op Fl o Ar outfile
.Sh DESCRIPTION
The
.Nm
utility is used to dump the contents of the kernel ktr trace buffer.
.Pp
The following options are available:
.Bl -tag -width ".Fl N Ar execfile"
.It Fl a
Print all fields.  Implies all print options.
.It Fl c
Print the CPU number that each entry was logged from.
.It Fl f
Print the file and line number that each entry was logged from.
.It Fl i
Print the ID string field, identifying the facility being logged.
.It Fl n
.Nm
normally tries to translate the caller fields and (when easily parsed)
trace arguments into symbols.  This option forces hex values to be
displayed instead.  This option will also cause relative timestamps to
be displayed as TSC timestamps rather then converted to microseconds.
.It Fl p
Print the trace data.
.It Fl q
Quiet mode; do not print the column header.
.It Fl r
Print relative timestamps in microseconds, rather than absolute TSC
timestamps.
.It Fl s
Attempt to merge the KTR logs for all cpus into a single time-sorted
log.  For the numbers to make any sense you probably want to turn
on the
.Va debug.ktr.resynchronize
sysctl variable.
.It Fl x
Print the call chain leading up to the procedure which issued
the KTR.
.It Fl t
Print the timestamp for each entry.
.Xr ktr 4
manual page.
.It Fl N Ar execfile
The kernel image to resolve symbols from.
The default is the value returned via
.Xr getbootfile 3 .
.It Fl M Ar corefile
The core file or memory image to read from.
The default is
.Pa /dev/mem .
.It Fl o Ar outfile
The file to write the output to.
The default is standard output.
.El
.Sh SEE ALSO
.Xr ktr 4 ,
.Xr ktr 9
.Sh HISTORY
The
.Nm
utility first appeared in
.Fx 5.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
utility was implemented by
.An Jake Burkholder Aq jake@FreeBSD.org .
.Pp
This manual page was written by
.An Chad David Aq davidc@FreeBSD.org .
