DragonFlyBSD/DragonFlyBSD/share/man/man4/ahc.4
.\"
.\" Copyright (c) 1995, 1996, 1997, 1998, 2000
.\" 	Justin T. Gibbs.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD: src/share/man/man4/ahc.4,v 1.38.2.1 2006/06/05 19:30:28 brueffer Exp $
.\"
.Dd September 26, 2007
.Dt AHC 4
.Os
.Sh NAME
.Nm ahc
.Nd Adaptec PCI SCSI host adapter driver
.Sh SYNOPSIS
To compile this driver into the kernel,
place the following lines in your
kernel configuration file:
.Bd -ragged -offset indent
.Cd "device scbus"
.Cd "device ahc"
.Cd "device pci"
.Pp
To allow PCI adapters to use memory mapped I/O if enabled:
.Cd options AHC_ALLOW_MEMIO
.Pp
To compile in debugging code:
.Cd options AHC_DEBUG
.Cd options AHC_DEBUG_OPTS=<bitmask of options>
.Cd options AHC_REG_PRETTY_PRINT
.Pp
To configure one or more controllers to assume the target role:
.Cd options AHC_TMODE_ENABLE <bitmask of units>
.Ed
.Pp
Alternatively, to load the driver as a
module at boot time, place the following lines in
.Xr loader.conf 5 :
.Bd -literal -offset indent
ahc_load="YES"
ahc_pci_load="YES"
.Ed
.Sh DESCRIPTION
This driver provides access to the
.Tn SCSI
bus(es) connected to the Adaptec AIC77xx and AIC78xx
host adapter chips.
.Pp
Driver features include support for twin and wide busses,
fast, ultra or ultra2 synchronous transfers depending on controller type,
tagged queueing, SCB paging, and target mode.
.Pp
Memory mapped I/O can be enabled for PCI devices with the
.Dq Dv AHC_ALLOW_MEMIO
configuration option.
Memory mapped I/O is more efficient than the alternative, programmed I/O.
Most PCI BIOSes will map devices so that either technique for communicating
with the card is available.
In some cases,
usually when the PCI device is sitting behind a PCI->PCI bridge,
the BIOS may fail to properly initialize the chip for memory mapped I/O.
The typical symptom of this problem is a system hang if memory mapped I/O
is attempted.
Most modern motherboards perform the initialization correctly and work fine
with this option enabled.
.Pp
The
.Dv AHC_DEBUG_OPTS
option is used to control which diagnostic messages are printed to the
console when
.Dv AHC_DEBUG
is enabled.
Logically OR the following bits together:
.Bl -column -offset indent ".Em Value" ".Em Function"
.It Em Value Ta Em Function
.It 0x0001 Ta Show miscellaneous information
.It 0x0002 Ta Show sense data
.It 0x0004 Ta Show Serial EEPROM contents
.It 0x0008 Ta Show bus termination settings
.It 0x0010 Ta Show host memory usage
.It 0x0020 Ta Show SCSI protocol messages
.\".It 0x0040 XXX: AHC_SHOW_DV
.It 0x0080 Ta Show selection timeouts
.It 0x0200 Ta Show Queue Full status
.It 0x0400 Ta Show SCB queue status
.It 0x0800 Ta Show inbound packet information
.\".It 0x1000 XXX: AHC_SHOW_MASKED_ERRORS
.It 0x2000 Ta Enable extra diagnostic code in the firmware
.El
.Pp
The
.Dv AHC_REG_PRETTY_PRINT
option compiles in support for human-readable bit definitions for each register
that is printed by the debugging code.
.Pp
Individual controllers may be configured to operate in the target role
through the
.Dq Dv AHC_TMODE_ENABLE
configuration option.
The value assigned to this option should be a bitmap
of all units where target mode is desired.
For example, a value of 0x25, would enable target mode on units 0, 2, and 5.
A value of 0x8a enables it for units 1, 3, and 7.
.Pp
Per target configuration performed in the
.Tn SCSI-Select
menu, accessible at boot, is honored by this driver.
This includes synchronous/asynchronous transfers,
maximum synchronous negotiation rate,
wide transfers,
disconnection
and the host adapter's SCSI ID.
For systems that store non-volatile settings in a system specific manner
rather than a serial eeprom directly connected to the aic7xxx controller,
the
.Tn BIOS
must be enabled for the driver to access this information.
This restriction applies to many motherboard configurations.
.Pp
Note that I/O addresses are determined automatically by the probe routines.
.Pp
Performance and feature sets vary throughout the aic7xxx product line.
The following table provides a comparison of the different chips supported
by the
.Nm
driver.
Note that wide and twin channel features, although always supported
by a particular chip, may be disabled in a particular motherboard or card
design.
.Bd -ragged -compact
.Bl -column "aic7850 " "MIPS " "PCI/32 " "MaxSync " "MaxWidth " "SCBs " "1 2 3 4 5 6 7 8 "
.It Em Chip Ta Em MIPS Ta Em Bus Ta Em MaxSync Ta Em MaxWidth Ta Em SCBs Ta Em Features
.It aic7850 Ta 10 Ta PCI/32 Ta 10MHz Ta 8Bit Ta 3
.It aic7860 Ta 10 Ta PCI/32 Ta 20MHz Ta 8Bit Ta 3
.It aic7870 Ta 10 Ta PCI/32 Ta 10MHz Ta 16Bit Ta 16
.It aic7880 Ta 10 Ta PCI/32 Ta 20MHz Ta 16Bit Ta 16
.It aic7890 Ta 20 Ta PCI/32 Ta 40MHz Ta 16Bit Ta 16 Ta "    3 4 5 6 7 8"
.It aic7891 Ta 20 Ta PCI/64 Ta 40MHz Ta 16Bit Ta 16 Ta "    3 4 5 6 7 8"
.It aic7892 Ta 20 Ta PCI/64 Ta 80MHz Ta 16Bit Ta 16 Ta "    3 4 5 6 7 8"
.It aic7895 Ta 15 Ta PCI/32 Ta 20MHz Ta 16Bit Ta 16 Ta "  2 3 4 5"
.It aic7895C Ta 15 Ta PCI/32 Ta 20MHz Ta 16Bit Ta 16 Ta "  2 3 4 5     8"
.It aic7896 Ta 20 Ta PCI/32 Ta 40MHz Ta 16Bit Ta 16 Ta "  2 3 4 5 6 7 8"
.It aic7897 Ta 20 Ta PCI/64 Ta 40MHz Ta 16Bit Ta 16 Ta "  2 3 4 5 6 7 8"
.It aic7899 Ta 20 Ta PCI/64 Ta 80MHz Ta 16Bit Ta 16 Ta "  2 3 4 5 6 7 8"
.El
.Pp
.Bl -enum -compact
.It
Multiplexed Twin Channel Device - One controller servicing two busses.
.It
Multi-function Twin Channel Device - Two controllers on one chip.
.It
Command Channel Secondary DMA Engine - Allows scatter gather list and
SCB prefetch.
.It
64 Byte SCB Support - SCSI CDB is embedded in the SCB to eliminate an extra DMA.
.It
Block Move Instruction Support - Doubles the speed of certain sequencer
operations.
.It
.Sq Bayonet
style Scatter Gather Engine - Improves S/G prefetch performance.
.It
Queuing Registers - Allows queueing of new transactions without pausing the
sequencer.
.It
Multiple Target IDs - Allows the controller to respond to selection as a
target on multiple SCSI IDs.
.El
.Ed
.Sh HARDWARE
The
.Nm
driver supports the following
.Tn SCSI
host adapter chips and
.Tn SCSI
controller cards:
.Pp
.Bl -bullet -compact
.It
Adaptec
.Tn AIC7770
host adapter chip
.It
Adaptec
.Tn AIC7850
host adapter chip
.It
Adaptec
.Tn AIC7860
host adapter chip
.It
Adaptec
.Tn AIC7870
host adapter chip
.It
Adaptec
.Tn AIC7880
host adapter chip
.It
Adaptec
.Tn AIC7890
host adapter chip
.It
Adaptec
.Tn AIC7891
host adapter chip
.It
Adaptec
.Tn AIC7892
host adapter chip
.It
Adaptec
.Tn AIC7895
host adapter chip
.It
Adaptec
.Tn AIC7896
host adapter chip
.It
Adaptec
.Tn AIC7897
host adapter chip
.It
Adaptec
.Tn AIC7899
host adapter chip
.It
Adaptec
.Tn 274X(W)
.It
Adaptec
.Tn 274X(T)
.It
Adaptec
.Tn 284X
.It
Adaptec
.Tn 2910
.It
Adaptec
.Tn 2915
.It
Adaptec
.Tn 2920
.It
Adaptec
.Tn 2930C
.It
Adaptec
.Tn 2930U2
.It
Adaptec
.Tn 2940
.It
Adaptec
.Tn 2940J
.It
Adaptec
.Tn 2940N
.It
Adaptec
.Tn 2940U
.It
Adaptec
.Tn 2940AU
.It
Adaptec
.Tn 2940UW
.It
Adaptec
.Tn 2940UW Dual
.It
Adaptec
.Tn 2940UW Pro
.It
Adaptec
.Tn 2940U2W
.It
Adaptec
.Tn 2940U2B
.It
Adaptec
.Tn 2950U2W
.It
Adaptec
.Tn 2950U2B
.It
Adaptec
.Tn 19160B
.It
Adaptec
.Tn 29160B
.It
Adaptec
.Tn 29160N
.It
Adaptec
.Tn 3940
.It
Adaptec
.Tn 3940U
.It
Adaptec
.Tn 3940AU
.It
Adaptec
.Tn 3940UW
.It
Adaptec
.Tn 3940AUW
.It
Adaptec
.Tn 3940U2W
.It
Adaptec
.Tn 3950U2
.It
Adaptec
.Tn 3960
.It
Adaptec
.Tn 39160
.It
Adaptec
.Tn 3985
.It
Adaptec
.Tn 4944UW
.It
NEC PC-9821Xt13 (PC-98)
.It
NEC RvII26 (PC-98)
.It
NEC PC-9821X-B02L/B09 (PC-98)
.It
NEC SV-98/2-B03 (PC-98)
.It
Many motherboards with on-board
.Tn SCSI
support
.El
.Sh SCSI CONTROL BLOCKS (SCBs)
Every transaction sent to a device on the SCSI bus is assigned a
.Sq SCSI Control Block
(SCB).
The SCB contains all of the information required by the
controller to process a transaction.
The chip feature table lists
the number of SCBs that can be stored in on-chip memory.
All chips
with model numbers greater than or equal to 7870 allow for the on chip
SCB space to be augmented with external SRAM up to a maximum of 255 SCBs.
Very few Adaptec controller configurations have external SRAM.
.Pp
If external SRAM is not available, SCBs are a limited resource.
Using the SCBs in a straight forward manner would only allow the driver to
handle as many concurrent transactions as there are physical SCBs.
To fully utilize the SCSI bus and the devices on it,
requires much more concurrency.
The solution to this problem is
.Em SCB Paging ,
a concept similar to memory paging.
SCB paging takes advantage of
the fact that devices usually disconnect from the SCSI bus for long
periods of time without talking to the controller.
The SCBs for disconnected transactions are only of use to the controller
when the transfer is resumed.
When the host queues another transaction
for the controller to execute, the controller firmware will use a
free SCB if one is available.
Otherwise, the state of the most recently
disconnected (and therefore most likely to stay disconnected) SCB is
saved, via dma, to host memory, and the local SCB reused to start
the new transaction.
This allows the controller to queue up to
255 transactions regardless of the amount of SCB space.
Since the
local SCB space serves as a cache for disconnected transactions, the
more SCB space available, the less host bus traffic consumed saving
and restoring SCB data.
.Sh SEE ALSO
.Xr cd 4 ,
.Xr da 4 ,
.Xr sa 4 ,
.Xr scsi 4
.Sh HISTORY
The
.Nm
driver appeared in
.Fx 2.0 .
.Sh AUTHORS
The
.Nm
driver, the
.Tn AIC7xxx
sequencer-code assembler,
and the firmware running on the aic7xxx chips were written by
.An Justin T. Gibbs .
.Sh BUGS
Some Quantum drives (at least the Empire 2100 and 1080s) will not run on an
.Tn AIC7870
Rev B in synchronous mode at 10MHz.
Controllers with this problem have a
42 MHz clock crystal on them and run slightly above 10MHz.
This confuses the drive and hangs the bus.
Setting a maximum synchronous negotiation rate of 8MHz in the
.Tn SCSI-Select
utility will allow normal operation.
.Pp
Although the Ultra2 and Ultra160 products have sufficient instruction
ram space to support both the initiator and target roles concurrently,
this configuration is disabled in favor of allowing the target role
to respond on multiple target ids.
A method for configuring dual role mode should be provided.
.Pp
Tagged Queuing is not supported in target mode.
.Pp
Reselection in target mode fails to function correctly on all high
voltage differential boards as shipped by Adaptec.
Information on
how to modify HVD board to work correctly in target mode is available
from Adaptec.
