DragonFlyBSD/DragonFlyBSD/share/man/man4/ahci.4
.\"	$OpenBSD: ahci.4,v 1.7 2008/04/19 01:18:39 djm Exp $
.\"
.\" Copyright (c) 2006 David Gwynne <dlg@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" TORTIOUS ACTION, ARISING OUT OF
.\" PERFORMANCE OF THIS SOFTWARE.
.\"
.\" Copyright (c) 2016 The DragonFly Project.  All rights reserved.
.\"
.\" This code is derived from software contributed to The DragonFly Project
.\" by Matthew Dillon <dillon@backplane.com>
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\"
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in
.\"    the documentation and/or other materials provided with the
.\"    distribution.
.\" 3. Neither the name of The DragonFly Project nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific, prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
.\" LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
.\" FOR A PARTICULAR PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE
.\" COPYRIGHT HOLDERS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
.\" OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd November 28, 2014
.Dt AHCI 4
.Os
.Sh NAME
.Nm ahci
.Nd Advanced Host Controller Interface for Serial ATA
.Sh SYNOPSIS
To compile this driver into the kernel,
place the following line in your
kernel configuration file:
.Bd -ragged -offset indent
.Cd "device ahci"
.Ed
.Pp
Alternatively, to load the driver as a
module at boot time, place the following line in
.Xr loader.conf 5 :
.Bd -literal -offset indent
ahci_load="YES"
.Ed
.Sh DESCRIPTION
The
.Nm
driver provides support for Serial ATA controllers conforming to the
Advanced Host Controller Interface specification.
.Pp
Several AHCI capable controllers also provide a compatibility mode that
causes them to appear as a traditional ATA controller supported by
.Xr nata 4 .
.Pp
Although
.Nm
controllers are actual ATA controllers, the driver emulates SCSI via a
translation layer.
.Sh LOADER TUNABLES
The following hints may be set in
.Xr loader.conf 5
to control the
.Nm
driver's behavior.
Note that the hint need only exist, so removing it requires commenting it out.
.Pp
Usually both the
.Xr nata 4
and the
.Nm
drivers are loaded.
The
.Xr nata 4
driver will pick up any ata-like devices which the
.Nm
driver misses.
If the
.Nm
driver is disabled the
.Xr nata 4
driver will typically pick up the
.Nm
devices, albeit under the
.Pa ad
disk name rather than the
.Pa da
disk name.
.Bd -literal -offset indent
hint.ahci.disabled=1
.Ed
.Pp
The
.Nm
driver can be told to force a lower-speed 1.5Gb link speed
if necessary, and can also be told to refrain from attempting to send
certain higher-level ATA commands to initialize ATA features which
some devices might not properly implement.
.Bd -literal -offset indent
hint.ahci.force150=1
hint.ahci.nofeatures=1
.Ed
.Pp
By default, the driver will use MSI if it is supported.
This behavior can be turned off by setting the following tunable:
.Bd -literal -offset indent
hw.ahci.msi.enable=0
.Ed
.Sh SYSCTL VARIABLES
Link power management can be set with the sysctl
.Va dev.ahci.%d.%d.link_pwr_mgmt
to 0 for `disabled', 1 for `medium', and 2 for `aggressive'.
Link power state can be read with the sysctl
.Va dev.ahci.%d.%d.link_pwr_state .
.Sh SEE ALSO
.Xr intro 4 ,
.Xr nata 4 ,
.Xr pci 4 ,
.Xr scsi 4 ,
.Xr sili 4 ,
.Xr nvme 4 ,
.Xr loader.conf 5
.Sh HISTORY
The
.Nm
driver first appeared in
.Dx 2.3 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was originally written by
.An David Gwynne Aq Mt dlg@openbsd.org
and
.An Christopher Pascoe Aq Mt pascoe@openbsd.org
for
.Ox .
.Pp
It was ported to
.Dx
by
.An Matt Dillon Aq Mt dillon@apollo.backplane.com ,
who substantially rewrote the driver (honestly, just about from scratch
but having the openbsd code as a reference helped a lot), and
added new features such as hot-plug and port multiplier support.
