DragonFlyBSD/DragonFlyBSD/share/man/man4/amdgpu.4
.\"
.\" Copyright (c) 2026 The DragonFly Project.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\"
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in
.\"    the documentation and/or other materials provided with the
.\"    distribution.
.\" 3. Neither the name of The DragonFly Project nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific, prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
.\" LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
.\" FOR A PARTICULAR PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE
.\" COPYRIGHT HOLDERS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
.\" OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd Jan 17, 2026
.Dt AMDGPU 4
.Os
.Sh NAME
.Nm amdgpu
.Nd Driver for newer AMD graphics chipsets
.Sh DESCRIPTION
The
.Nm
driver provides support for the newer AMD graphics chips,
beginning with the Arctic Islands/Polaris family (Radeon RX 400 series).
Please refer to the
.Sx Loader Tunables
section in
.Xr syscons 4
for more information about how to make the console work with
.Nm .
.Pp
In order to use the driver one needs to install the
.Pa sysutils/devfw-amdgpu
package available in
.Xr dports 7 .
.Sh EXAMPLES
.Bd -literal
Section "Device"
        Identifier "Screen0"
        Driver "modesetting"
        Option "kmsdev" "/dev/dri/card0"
        Option "AccelMethod" "None"
EndSection
.Ed
.Sh LOADER TUNABLES
Tunables can be set at the
.Xr loader 8
prompt before booting the kernel or stored in
.Xr loader.conf 5 .
.Bl -tag -width "xxxxxx"
.It Va drm.amdgpu.cik_support
Enable/Disable support for CIK GPU generation (KAVERI, BONAIRE, HAWAII, KABINI,
and MULLINS). These GPUs are handled by the radeon(4) driver by default.
1 = enable, 0 = disable (default)
.Sh SEE ALSO
.Xr drm 4 ,
.Xr radeon 4
.Xr syscons 4
.Sh HISTORY
The
.Nm
driver was first available for Linux.
.Sh CAVEATS
Currently, only the modesetting driver is supported for
.Xr Xorg 1 .
.Pp
When using the optional support for CIK GPUs, it may be necessary to use the
.Va drm.video.<connector>
tunable documented in the
.Sx LOADER TUNABLES
section in
.Xr drm 4
to force a console framebuffer in 16bpp or 32bpp mode. This is due to
.Nm
sometimes defaulting to an 8bpp framebuffer console which is currently
not supported in
.Xr syscons 4 .
