DragonFlyBSD/DragonFlyBSD/share/man/man4/corepower.4
.\"-
.\" Copyright (c) 2015 Imre Vadász
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd August 12, 2015
.Dt COREPOWER 4
.Os
.Sh NAME
.Nm corepower
.Nd device driver for Intel Core on-die power usage estimation
.Sh SYNOPSIS
To compile this driver into the kernel,
place the following line in your
kernel configuration file:
.Bd -ragged -offset indent
.Cd "device corepower"
.Ed
.Pp
Alternatively, to load the driver as a
module at boot time, place the following line in
.Xr loader.conf 5 :
.Bd -literal -offset indent
corepower_load="YES"
.Ed
.Sh DESCRIPTION
The
.Nm
driver provides support for Intel's on-die power usage estimation, that is
provided in Sandy Bridge and newer Core and Xeon CPUs, and in Atom CPUs
of the Silvermont and newer architectures.
The values are exposed through the
.Dv HW_SENSORS
.Xr sysctl 3
tree.
For example:
.Bd -literal -offset indent
% sysctl hw.sensors
hw.sensors.cpu_node0.power0: 0.84 W (node0 Package Power)
hw.sensors.cpu_node0.power1: 0.73 W (node0 DRAM Power)
hw.sensors.cpu_node0.power2: 0.02 W (node0 Cores Power)
hw.sensors.cpu_node0.power3: 0.00 W (node0 Graphics Power)
.Ed
.Pp
Both the
.Dq Cores Power
and the
.Dq Graphics Power
values are included in the
.Dq Package Power
value, which estimates the total power usage of the CPU package.
.Sh SEE ALSO
.Xr systat 1 ,
.Xr sysctl 3 ,
.Xr devctl 4 ,
.Xr devd 8 ,
.Xr sensorsd 8 ,
.Xr sysctl 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Dx 4.3 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Imre Vadasz Aq Mt imre@vdsz.com .
.Sh BUGS
For some Xeon and Core-i CPUs this driver might incorrectly assume that the
MSR_PP1_ENERGY_STATUS MSR for measuring power usage of the integrated GPU is
available.
