DragonFlyBSD/DragonFlyBSD/share/man/man4/i915kms.4
.\"
.\" Copyright (c) 2015 The DragonFly Project.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\"
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in
.\"    the documentation and/or other materials provided with the
.\"    distribution.
.\" 3. Neither the name of The DragonFly Project nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific, prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
.\" LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
.\" FOR A PARTICULAR PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE
.\" COPYRIGHT HOLDERS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
.\" OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd October 27, 2015
.Dt I915KMS 4
.Os
.Sh NAME
.Nm i915kms
.Nd Driver for Intel i915 family integrated graphics chipsets
.Sh DESCRIPTION
The
.Nm
driver provides support for integrated graphics chips by Intel.
Please refer the
.Sx Loader Tunables
section in
.Xr syscons 4
for more information about how to make the console work with
.Nm .
.Sh LOADER TUNABLES
Tunables can be set at the
.Xr loader 8
prompt before booting the kernel or stored in
.Xr loader.conf 5 .
.Bl -tag -width "xxxxxx"
.It Va drm.i915.enable_psr
Enable PSR (panel self refresh), only relevant for Haswell and Broadwell
CPUs.
1 = enable, 0 = disable (default).
To maximize PSR usage, it can be beneficial to set
.Va hw.dri.vblank_offdelay
(see
.Xr drm 4 )
to a sufficiently low value (or
.Li -1 ),
to minimize vblank interrupt activity.
.El
.Sh SYSCTL VARIABLES
If display backlight level can be controlled by the GPU (which is often
the case in notebooks), the sysctl
.Va hw.backlight_level
can be used to adjust the backlight level.
Permitted values are from 0 to the value of
.Va hw.backlight_max .
.Sh SEE ALSO
.Xr drm 4 ,
.Xr syscons 4
.Sh HISTORY
The
.Nm
driver was first available for Linux.
