DragonFlyBSD/DragonFlyBSD/share/man/man4/ipfirewall.4
.\"
.\" $FreeBSD: src/share/man/man4/ipfirewall.4,v 1.19.2.7 2002/11/18 21:51:16 luigi Exp $
.\" $DragonFly: src/share/man/man4/ipfirewall.4,v 1.5 2007/07/29 16:43:05 swildner Exp $
.\"
.Dd June 22, 1997
.Dt IPFW 4
.Os
.Sh NAME
.Nm ipfw
.Nd IP packet filter and traffic accounting
.Sh DESCRIPTION
.Nm Ipfw
is a system facility which allows filtering,
redirecting, and other operations on IP packets travelling through
system interfaces.
.Pp
The user interface for
.Nm
is implemented by the
.Xr ipfw 8
program.
.Sh KERNEL OPTIONS
The following options in the kernel configuration file are related to
.Nm
operation:
Options in the kernel configuration file:
.Bl -tag -width ".Cd options IPFIREWALL_VERBOSE_LIMIT"
.It Cd options IPFIREWALL
enable
.Nm
.It Cd options IPFIREWALL_VERBOSE
enable firewall logging
.It Cd options IPFIREWALL_VERBOSE_LIMIT
limit firewall logging
.It Cd options IPDIVERT
enable
.Xr divert 4
sockets
.El
.Sh SEE ALSO
.Xr setsockopt 2 ,
.Xr divert 4 ,
.Xr ip 4 ,
.Xr ipfw 8 ,
.Xr sysctl 8 ,
.Xr syslogd 8
