DragonFlyBSD/DragonFlyBSD/share/man/man4/kate.4
.\"	$OpenBSD: kate.4,v 1.1 2008/03/27 01:54:44 cnst Exp $
.\"
.\" Copyright (c) 2008/2010 Constantine A. Murenin <cnst+dfly@bugmail.mojo.ru>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd February 12, 2010
.Dt KATE 4
.Os
.Sh NAME
.Nm kate
.Nd AMD K8 temperature sensor
.Sh SYNOPSIS
To compile this driver into the kernel,
place the following lines in your
kernel configuration file:
.Bd -ragged -offset indent
.Cd "device pci"
.Cd "device kate"
.Ed
.Pp
Alternatively, to load the driver as a
module at boot time, place the following line in
.Xr loader.conf 5 :
.Bd -literal -offset indent
kate_load="YES"
.Ed
.Sh DESCRIPTION
The
.Nm
driver provides support for the temperature sensors available in the
AMD K8 family of processors.
(Subsequent AMD families are supported by
.Xr km 4 . )
.Pp
These sensors were officially introduced with
Revision F Family 0Fh processors,
and provide 1 degC accuracy.
Precision was improved in Revision G chips,
which provide two more bits for 0.25 degC steppings.
Each core may have two temperature sensors, and
there may be up to two cores per package.
.Pp
Multiprocessor systems would have one instance of
.Nm
per each chip.
In each instance,
.Va temp0
and
.Va temp1
sensors
correspond to the temperature sensors on the first core,
whereas
.Va temp2
and
.Va temp3
correspond to the temperature sensors on the second core.
As such, single core chips may have two sensors,
and dual-core dual-processor systems may have as many as 8
temperature sensors in total.
.Pp
Since many prior revisions of the chips appear to have
valid readings for at least some temperature sensors
in the same address space as the abovementioned revisions,
the driver may also attach on such older revisions provided
that it finds some sensor readings that appear valid.
However, in such cases
.Nm
would not print the core revision information into the dmesg.
.Pp
Sensor values are made available through the
.Dv HW_SENSORS
.Xr sysctl 3
interface,
and can be monitored with the
.Xr systat 1
.Ar sensors
display,
.Xr sensorsd 8
and
.Xr sysctl 8
.Ar hw.sensors .
.Sh SEE ALSO
.Xr systat 1 ,
.Xr sysctl 3 ,
.Xr intro 4 ,
.Xr km 4 ,
.Xr pci 4 ,
.Xr sensorsd 8 ,
.Xr sysctl 8
.Rs
.%T "BIOS and Kernel Developer's Guide for AMD NPT Family 0Fh Processors"
.%D July 2007
.%R Publication # 32559
.%P pp. 21--23 and pp. 179--184
.\" .%O http://www.amd.com/us-en/assets/content_type/white_papers_and_tech_docs/32559.pdf
.Re
.Rs
.%T "Revision Guide for AMD NPT Family 0Fh Processors"
.%D February 2008
.%R Publication # 33610
.\" .%O http://www.amd.com/us-en/assets/content_type/white_papers_and_tech_docs/33610.pdf
.Re
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.4
and
.Dx 2.5 .
.Sh AUTHORS
The
.Nm
driver was written for
.Ox
and
.Dx
by
.An Constantine A. Murenin
whilst at the University of Waterloo.
