DragonFlyBSD/DragonFlyBSD/share/man/man4/km.4
.\"	$OpenBSD: km.4,v 1.9 2013/07/16 16:05:49 schwarze Exp $
.\"
.\" Copyright (c) 2008/2010 Constantine A. Murenin <cnst+dfly@bugmail.mojo.ru>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd July 12, 2014
.Dt KM 4
.Os
.Sh NAME
.Nm km
.Nd AMD K10 temperature sensor
.Sh SYNOPSIS
To compile this driver into the kernel,
place the following lines in your
kernel configuration file:
.Bd -ragged -offset indent
.Cd "device pci"
.Cd "device km"
.Ed
.Pp
Alternatively, to load the driver as a
module at boot time, place the following line in
.Xr loader.conf 5 :
.Bd -literal -offset indent
km_load="YES"
.Ed
.Sh DESCRIPTION
The
.Nm
driver provides support for the temperature sensors available in the
AMD Family 10h, 11h, 12h, 14h, 15h and 16h processors.
.Pp
Each chip reports one temperature sensor.
Multiprocessor systems have one instance of
.Nm
per chip.
The highest resolution supported by the driver is 0.125 degC.
.Pp
Sensor values are made available through the
.Dv HW_SENSORS
.Xr sysctl 3
interface,
and can be monitored with the
.Xr systat 1
.Ar sensors
display,
.Xr sensorsd 8
and
.Xr sysctl 8
.Ar hw.sensors .
For example, with an
.Tn AMD
.Tn Phenom X4
9850 Black Edition 2.5GHz
.Tn Socket AM2+
125W quad-core processor:
.Bd -literal -offset indent
%sysctl hw.sensors.km0
hw.sensors.km0.temp0: 60.50 degC
.Ed
.Sh SEE ALSO
.Xr systat 1 ,
.Xr sysctl 3 ,
.Xr intro 4 ,
.Xr kate 4 ,
.Xr pci 4 ,
.Xr sensorsd 8 ,
.Xr sysctl 8
.Rs
.%T "BIOS and Kernel Developer's Guide for AMD Family 10h Processors"
.%D March 26, 2008
.%R Publication # 31116
.%P pp. 236--237 and pp. 243--244
.Re
.Rs
.%T "BIOS and Kernel Developer's Guide for AMD Family 11h Processors"
.%D July 07, 2008
.%R Publication # 41256
.%P pp. 156--157 and pp. 159--160
.Re
.Rs
.%T "BIOS and Kernel Developer's Guide for AMD Family 12h Processors"
.%D October 06, 2011
.%R Publication # 41131 Rev 3.02
.%P pp. 303--304 and p. 316
.Re
.Rs
.%T "BIOS and Kernel Developer's Guide for AMD Family 14h Models 00h-04h Processors"
.%D May 02, 2011
.%R Publication # 43170
.%P pp. 277--278 and pp. 280--282
.Re
.Rs
.%T "BIOS and Kernel Developer's Guide for AMD Family 15h Models 00h-0Fh Processors"
.%D January 23, 2013
.%R Publication # 42301 Rev 3.14
.%P pp. 374--375 and pp. 293--294
.Re
.Rs
.%T "BIOS and Kernel Developer's Guide for AMD Family 15h Models 10h-1Fh Processors"
.%D June 04, 2013
.%R Publication # 42300 Rev 3.10
.%P p. 419 and pp. 432--433
.Re
.Rs
.%T "BIOS and Kernel Developer's Guide for AMD Family 15h Models 30h-3Fh Processors"
.%D June 17, 2014
.%R Publication # 49125 Rev 3.03
.%P p. 440 and pp. 457--458
.Re
.Rs
.%T "Preliminary BIOS and Kernel Developer's Guide for AMD Family 16h Models 00h-0Fh Processors"
.%D May 30, 2013
.%R Publication # 48751 Rev 3.00
.%P p. 400 and pp. 418--419
.Re
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.4
and
.Dx 2.5 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written for
.Ox
and
.Dx
by
.An Constantine A. Murenin Aq Lk http://cnst.su/ ,
Raouf Boutaba Research Group,
David R. Cheriton School of Computer Science,
University of Waterloo.
