DragonFlyBSD/DragonFlyBSD/share/man/man4/mpt.4
.\" $DragonFly: src/share/man/man4/mpt.4,v 1.1 2004/06/05 15:02:05 hmp Exp $
.\"	$NetBSD: mpt.4,v 1.1 2003/04/16 22:32:15 thorpej Exp $
.\"	$FreeBSD: src/share/man/man4/mpt.4,v 1.2 2003/11/07 21:05:31 simon Exp $
.\"
.\" Copyright (c) 2004 Hiten Pandya <hmp@backplane.com>
.\" Copyright (c) 2003 Wasabi Systems, Inc.
.\" All rights reserved.
.\"
.\" Written by Jason R. Thorpe for Wasabi Systems, Inc.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed for the NetBSD Project by
.\"	Wasabi Systems, Inc.
.\" 4. The name of Wasabi Systems, Inc. may not be used to endorse
.\"    or promote products derived from this software without specific prior
.\"    written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY WASABI SYSTEMS, INC. ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL WASABI SYSTEMS, INC
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd 07 November, 2003
.Dt MPT 4
.Os
.Sh NAME
.Nm mpt
.Nd LSI Fusion-MPT SCSI/Fibre Channel driver
.Sh SYNOPSIS
.Cd "device mpt"
.Cd "device scbus"
.Sh DESCRIPTION
The
.Nm
driver provides support
for the LSI Logic Fusion-MPT family of
.Tn SCSI
and
.Tn Fibre Channel
controllers:
.Pp
.Bl -bullet -compact -offset indent
.It
53c1030
.Pq Dual Ultra320 Tn SCSI
.It
FC909
.Pq 1Gb/s Tn Fibre Channel
.It
FC909A
.Pq Dual 1Gb/s Tn Fibre Channel
.It
FC919
.Pq 2Gb/s Tn Fibre Channel
.It
FC929
.Pq Dual 2Gb/s Tn Fibre Channel
.El
.Pp
Some mainboards, e.g.
the
.Ql "IBM e335"
have a single port
.Li 53c1030
controller.
.Sh SEE ALSO
.Xr cd 4 ,
.Xr ch 4 ,
.Xr pci 4 ,
.Xr scsi 4 ,
.Xr sd 4 ,
.Xr st 4
.Rs
.%T "LSI Logic Website"
.%O http://www.lsilogic.com/
.Re
.Sh HISTORY
The
.Nm
driver first appeared in
.Fx 4.6 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was originally written for
.Fx
by
.An Greg Ansley
and substantially improved upon
by
.An Matt Jacob Aq mjacob@FreeBSD.org .
