DragonFlyBSD/DragonFlyBSD/share/man/man4/nv.4
.\"
.\" Copyright (c) 2003 Quinton Dolan
.\"
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND 
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE 
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED. IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $Id: nvnet.4,v 1.1 2003/10/09 16:48:01 q Exp $
.\" $DragonFly: src/share/man/man4/Attic/nv.4,v 1.2 2005/04/20 16:24:13 swildner Exp $
.\"
.Dd October 5, 2003
.Dt NV 4
.Os
.Sh NAME
.Nm nv
.Nd NVIDIA nForce MCP network adapter device driver
.Sh SYNOPSIS
.Cd "kldload if_nv.ko"
.Sh DESCRIPTION
The
.Nm
driver provides support for the NVIDIA nForce MCP and nForce2 MCP2 networking 
adapter that is embedded in the southbridge of most nForce and nForce2 
motherboards. This driver is a reimplementation of the NVIDIA supported Linux 
nvnet driver, and uses the same closed source API library to access the 
underlying hardware. There is currently no programming documentation available 
for this device, and therefore little is known about the internal architecture
of the MAC engine itself. 
.Pp
The
.Nm
driver supports the following media types:
.Pp
.Bl -tag -width xxxxxxxxxxxxxxxxxxxx
.It autoselect
Enable autoselection of the media type and options
.It 10baseT/UTP
Set 10Mbps operation
.It 100baseTX
Set 100Mbps (fast ethernet) operation
.El
.Pp
The
.Nm
driver supports the following media options:
.Pp
.Bl -tag -width xxxxxxxxxxxxxxxxxxxx
.It full-duplex
Set full duplex operation
.El
.Pp
Note that the nForce3 MCP3 may also work when run in 32/64bit compatibility
mode but as yet has not been tested. For further information on configuring this device, see
.Xr ifconfig 8 .
.Pp
.Sh DIAGNOSTICS
.Bl -diag
.It "nv%d: couldn't map memory"
A fatal initialization error has occurred.
.It "nv%d: couldn't map interrupt"
A fatal initialization error has occurred.
.It "nv%d: failed to allocate memory"
There are not enough mbuf's available for allocation.
.It "nv%d: device timeout"
The device has stopped responding to the network, or there is a problem with
the network connection (cable).
.El
.Sh SEE ALSO
.Xr arp 4 ,
.Xr miibus 4 ,
.Xr netintro 4 ,
.Xr ng_ether 4 ,
.Xr ifconfig 8
.Sh AUTHORS
.An -nosplit
The
.Nm
device driver was written by
.An Quinton Dolan <q@onthenet.com.au> .
