DragonFlyBSD/DragonFlyBSD/share/man/man4/nvmm.4
.\"
.\" Copyright (c) 2018-2021 Maxime Villard, m00nbsd.net
.\" All rights reserved.
.\"
.\" This code is part of the NVMM hypervisor.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd May 10, 2021
.Dt NVMM 4
.Os
.Sh NAME
.Nm nvmm
.Nd Lightweight Hypervisor
.Sh DESCRIPTION
The
.Nm
driver provides kernel support for hardware-accelerated virtualization.
It is made of a generic MI frontend, to which MD backends can be plugged
to implement the core virtualization.
.Pp
In practice,
.Nm
is used by the
.Xr libnvmm 3
API to implement hypervisors.
.Sh SUPPORT
The following backends are supported:
.Bl -hyphen -compact -offset indent
.It
x86-SVM, for x86 AMD CPUs
.It
x86-VMX, for x86 Intel CPUs
.El
.Sh SEE ALSO
.Xr libnvmm 3 ,
.Xr nvmmctl 8
.Sh AUTHORS
The
.Nm
driver was written by
.An Maxime Villard .
.Sh HISTORY
.Nm
first appeared in
.Nx
9,
and was ported to
.Dx
6.1.
