DragonFlyBSD/DragonFlyBSD/share/man/man4/re.4
.\" Copyright (c) 2003
.\"	Bill Paul <wpaul@windriver.com>. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Bill Paul.
.\" 4. Neither the name of the author nor the names of any co-contributors
.\"    may be used to endorse or promote products derived from this software
.\"   without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY Bill Paul AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL Bill Paul OR THE VOICES IN HIS HEAD
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF
.\" THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd November 14, 2016
.Dt RE 4
.Os
.Sh NAME
.Nm re
.Nd "RealTek 816xS/811xS/8101E/8105E PCI/PCIe Ethernet adapter driver"
.Sh SYNOPSIS
.Cd "device miibus"
.Cd "device re"
.Pp
Alternatively, to load the driver as a module at boot time, place the
following line in
.Pa /boot/loader.conf :
.Bd -literal -offset indent
if_re_load="YES"
.Ed
.Sh DESCRIPTION
The
.Nm
driver provides support for various NICs based on the RealTek
RTL8169S, RTL8110S, RTL8168S, RTL8111S and RTL8101E
PCI and PCIe ethernet controllers.
.Pp
NICs based on the
8101E are capable of 10 and 100Mbps speeds over CAT5 cable.
NICs based on the
816xS and 811xS are capable of 10, 100 and 1000Mbps operation.
.Pp
All NICs supported by the
.Nm
driver have TCP/IP checksum offload and hardware VLAN tagging/insertion
features, and use a descriptor-based DMA mechanism. They are also
capable of TCP large send (TCP segmentation offload).
.Pp
The 8169S and 8110S are single-chip devices containing both a 10/100/1000
MAC and 10/100/1000 copper PHY. Standalone 10/100/1000 cards are available
in both 32-bit PCI and 64-bit PCI models. The 8110S is designed for
embedded LAN-on-motherboard applications.
.Pp
.\"The 8169S and 8110S also support jumbo frames, which can be configured
.\"via the interface MTU setting.
.\"Selecting an MTU larger than 1500 bytes with the
.\".Xr ifconfig 8
.\"utility configures the adapter to receive and transmit jumbo frames.
.\"The maximum MTU setting for Jumbo Frames is 7426.
.\"This value coincides with the maximum Jumbo Frames size of 7440.
.\".Pp
The
.Nm
driver supports the following media types:
.Bl -tag -width 10baseTXUTP
.It Cm autoselect
Enable autoselection of the media type and options.
The user can manually override
the autoselected mode by adding media options to
.Xr rc.conf 5 .
.It Cm 10baseT/UTP
Set 10Mbps operation.
The
.Xr ifconfig 8
.Ic mediaopt
option can also be used to select either
.Cm full-duplex
or
.Cm half-duplex
modes.
.It Cm 100baseTX
Set 100Mbps (fast ethernet) operation.
The
.Xr ifconfig 8
.Ic mediaopt
option can also be used to select either
.Cm full-duplex
or
.Cm half-duplex
modes.
.It Cm 1000baseT
Set 1000baseT operation over twisted pair.
The RealTek gigE chips support 1000Mbps in
.Cm full-duplex
mode only.
.\" .It Cm 1000baseSX
.\" Set 1000Mbps (gigabit ethernet) operation.
.\" Both
.\" .Cm full-duplex
.\" and
.\" .Cm half-duplex
.\" modes are supported.
.El
.Pp
The
.Nm
driver supports the following media options:
.Bl -tag -width full-duplex
.It Cm full-duplex
Force full duplex operation.
.It Cm half-duplex
Force half duplex operation.
.El
.Pp
For more information on configuring this device, see
.Xr ifconfig 8 .
The
.Nm
driver supports
.Xr polling 4 .
.Ss MIB Variables
A number of per-interface variables are implemented in the
.Va dev.re. Ns Em X
branch of the
.Xr sysctl 3
MIB.
.Bl -tag -width ".Va rx_desc_count"
.It Va rx_desc_count
Number of RX descriptors (read-only).
Use the tunable
.Va hw.re.rx_desc_count
to configure it.
.It Va tx_desc_count
Number of TX descriptors (read-only).
Use the tunable
.Va hw.re.tx_desc_count
to configure it.
.It Va imtype
Interrupt moderation type.
0 means disable interrupt moderation.
1 means using simulated interrupt moderation (default).
2 means using hardware interrupt moderation,
if hardware supports it.
Due to lack of proper document,
hardware interrupt moderation (2) may not work as expected.
.It Va sim_time
If
.Va imtype
is set to 1,
it controls interrupt moderation time (unit: 1us).
It will not have any effect,
if
.Va imtype
is 0 or 2.
By default, it is set to 150us.
.It Va hw_txtime
If the controller does not support hardware interrupt moderation,
then this sysctl node will not exist.
If
.Va imtype
is set to 2,
it controls TX interrupt moderation time (unit: 25us).
It will not have any effect,
if
.Va imtype
is 0 or 1.
It is set to 5 (125us) by default.
Due to lack of chip document,
it may not work reliably.
.It Va hw_rxtime
If the controller does not support hardware interrupt moderation,
then this sysctl node will not exist.
If
.Va imtype
is set to 2,
it controls RX interrupt moderation time (unit: 25us).
It will not have any effect,
if
.Va imtype
is 0 or 1.
It is set to 2 (50us) by default.
Due to lack of chip document,
it may not work reliably.
.El
.Sh HARDWARE
The
.Nm
driver supports RealTek RTL816xS, RTL811xS,
RTL8105E, and RTL8101E based Fast Ethernet and Gigabit Ethernet adapters
including:
.Pp
.Bl -bullet -compact
.It
Corega CG-LAPCIGT Gigabit Ethernet (8169S)
.It
D-Link DGE-528(T) Gigabit Ethernet (8169S)
.It
Gigabyte 7N400 Pro2 Integrated Gigabit Ethernet (8110S)
.It
LevelOne GNC-0105T (8169S)
.It
LinkSys EG1032 (32-bit PCI)
.It
PLANEX COMMUNICATIONS Inc.\& GN-1200TC (8169S)
.El
.Sh SEE ALSO
.Xr arp 4 ,
.Xr ifmedia 4 ,
.Xr netintro 4 ,
.Xr ng_ether 4 ,
.Xr polling 4 ,
.Xr vlan 4 ,
.Xr ifconfig 8
.\".Rs
.\".%T RealTek Semiconductor RTL8169S and RTL8110S datasheets
.\".%O http://www.realtek.com.tw
.\".Re
.Sh HISTORY
The
.Nm
device driver first appeared in
.Fx 5.2
and
.Dx 1.0 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Bill Paul Aq Mt wpaul@windriver.com .
