DragonFlyBSD/DragonFlyBSD/share/man/man4/sili.4
.\"	$OpenBSD: sili.4,v 1.3 2007/05/31 19:19:52 jmc Exp $
.\"
.\" Copyright (c) 2007 David Gwynne <dlg@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" TORTIOUS ACTION, ARISING OUT OF
.\" PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd June 23, 2009
.Dt SILI 4
.Os
.Sh NAME
.Nm sili
.Nd Silicon Image 3124/3132 SATA controller
.Sh SYNOPSIS
To compile this driver into the kernel,
place the following line in your
kernel configuration file:
.Bd -ragged -offset indent
.Cd "device sili"
.Ed
.Pp
Alternatively, to load the driver as a
module at boot time, place the following line in
.Xr loader.conf 5 :
.Bd -literal -offset indent
sili_load="YES"
.Ed
.Sh DESCRIPTION
The
.Nm
driver provides support for SATA controllers using the Silicon Image
3124/3132 SATALink chipsets. Both 3124-1 (1.5 Gbps) and 3124-2 (3 Gbps)
versions of the 3124 chip are supported.
.Pp
Although
.Nm
controllers are actual ATA controllers, the driver emulates SCSI via a
translation layer.
.Sh LOADER TUNABLES
The following hints may be set in
.Xr loader.conf 5
to control the
.Nm
driver's behavior.
Note that the hint need only exist, so removing it requires commenting it out.
.Pp
Usually both the
.Xr nata 4
and the
.Nm
drivers are loaded.
The
.Xr nata 4
driver will pick up any ata-like devices which the
.Nm
driver misses.
If the
.Nm
driver is disabled the
.Xr nata 4
driver will typically pick up the
.Nm
devices, albeit under the
.Pa ad
disk name rather than the
.Pa da
disk name.
.Bd -literal -offset indent
hint.sili.disabled=1
.Ed
.Pp
The
.Nm
driver can be told to force a lower-speed 1.5Gb link speed
if necessary, and can also be told to refrain from attempting to send
certain higher-level ATA commands to initialize ATA features which
some devices might not properly implement.
.Bd -literal -offset indent
hint.sili.force150=1
hint.sili.nofeatures=1
.Ed
.Sh SEE ALSO
.Xr ahci 4 ,
.Xr intro 4 ,
.Xr nata 4 ,
.Xr pci 4 ,
.Xr scsi 4 ,
.Xr loader.conf 5
.Sh HISTORY
The
.Nm
driver first appeared in
.Dx 2.3 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was originally written by
.An David Gwynne Aq Mt dlg@openbsd.org
and
.An Christopher Pascoe Aq Mt pascoe@openbsd.org
for
.Ox .
.Pp
It was ported to
.Dx
by
.An Matt Dillon Aq Mt dillon@apollo.backplane.com ,
who added new features such as hot-plug and port multiplier support.
