DragonFlyBSD/DragonFlyBSD/share/man/man4/smbacpi.4
.\"
.\" Copyright (c) 2016 The DragonFly Project.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\"
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in
.\"    the documentation and/or other materials provided with the
.\"    distribution.
.\" 3. Neither the name of The DragonFly Project nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific, prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
.\" LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
.\" FOR A PARTICULAR PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE
.\" COPYRIGHT HOLDERS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
.\" OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd June 1, 2016
.Dt SMBACPI 4
.Os
.Sh NAME
.Nm smbacpi
.Nd ACPI support for I2cSerialBus Connections
.Sh SYNOPSIS
To compile this module into the kernel,
place the following lines in your
kernel configuration file:
.Bd -ragged -offset indent
.Cd device acpi
.Cd device smbus
.Cd device smbacpi
.Ed
.Pp
Alternatively, to load the module at boot time,
place the following line in
.Xr loader.conf 5 :
.Bd -literal -offset indent
smbacpi_load="YES"
.Ed
.Sh DESCRIPTION
The
.Nm
module provides ACPI support for accesses to I2cSerialBus Connections
specified in ACPI-5.0 GenericSerialBus Operation Regions.
.Sh SEE ALSO
.Xr acpi 4 ,
.Xr gpio_acpi 4 ,
.Xr ichiic 4 ,
.Xr smbus 4
.Sh AUTHORS
.An Imre Vadasz
