DragonFlyBSD/DragonFlyBSD/share/man/man4/snd_spicds.4
.\" Copyright (c) 2006 Alexander Leidinger
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD: head/share/man/man4/snd_spicds.4 267938 2014-06-26 21:46:14Z bapt $
.\"
.Dd January 8, 2015
.Dt SND_SPICDS 4
.Os
.Sh NAME
.Nm snd_spicds
.Nd "I2S SPI audio codec driver"
.Sh SYNOPSIS
To compile this driver into the kernel, place the following lines in your
kernel configuration file:
.Bd -ragged -offset indent
.Cd "device snd_spicds"
.Ed
.Pp
Alternatively, to load the driver as a module at boot time, place the
following line in
.Xr loader.conf 5 :
.Bd -literal -offset indent
snd_spicds_load="YES"
.Ed
.Sh DESCRIPTION
The
.Nm
I2S codec driver is used by several sound drivers for soundcards which use
the supported codec chips.
.Sh HARDWARE
The
.Nm
driver supports the following codecs:
.Pp
.Bl -bullet -compact
.It
AK4358
.It
AK4381
.It
AK4396
.It
AK4524
.It
AK4528
.It
WM8770
.El
.Sh SEE ALSO
.Xr snd_envy24 4 ,
.Xr snd_envy24ht 4 ,
.Xr sound 4
.Sh HISTORY
The
.Nm
device driver first appeared in
.Fx 6.3 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Konstantin Dimitrov
based upon the
.Xr snd_envy24 4
driver.
This manual page was written by
.An Alexander Leidinger Aq Mt netchild@FreeBSD.org .
