DragonFlyBSD/DragonFlyBSD/share/man/man4/tbridge.4
.\" Copyright (c) 2020 The DragonFly BSD Project.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"
.Dd November 25, 2020
.Dt TBRIDGE 4
.Os
.Sh NAME
.Nm tbridge
.Nd Testbridge Device Support
.Sh SYNOPSIS
To compile testbridge device support into the kernel, place the following lines
in your kernel configuration file:
.Bd -ragged -offset indent
.Cd "device tbridge"
.Ed
.Pp
Alternatively, to load testbridge support as modules at boot time, place the
following lines in
.Xr loader.conf 5 :
.Bd -literal -offset indent
tbridge_load="YES"
.Ed
.Sh DESCRIPTION
The
.Nm
driver is part of the
.Xr dfregress 8
suite and it provides the interface for running test cases in the kernel space.
Each test case will have the form of a kernel module which is loaded and
unloaded automatically during the test process.
For this reason, the
.Nm
kernel module must be loaded before
.Xr dfregress 8
is run.
.Sh SEE ALSO
.Xr dfregress 8 ,
.Xr tbridge 9
.Sh AUTHORS
The
.Nm
driver was written for
.Dx
by
.An -nosplit
.An Alex Hornung Aq Mt alex@alexhornung.com .
