DragonFlyBSD/DragonFlyBSD/share/man/man4/uplcom.4
.\" $NetBSD: uplcom.4,v 1.9 2002/02/07 03:15:09 ross Exp $
.\"
.\" Copyright (c) 2001 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Lennart Augustsson.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgment:
.\"        This product includes software developed by the NetBSD
.\"        Foundation, Inc. and its contributors.
.\" 4. Neither the name of The NetBSD Foundation nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD: src/share/man/man4/uplcom.4,v 1.15 2006/08/20 05:56:00 imp Exp $
.\"
.Dd July 29, 2007
.Dt UPLCOM 4
.Os
.Sh NAME
.Nm uplcom
.Nd USB support for Prolific PL-2303/2303X/2303HX serial adapters driver
.Sh SYNOPSIS
To compile this driver into the kernel,
place the following lines in your
kernel configuration file:
.Bd -ragged -offset indent
.Cd "device uplcom"
.Cd "device ucom"
.Ed
.Pp
Alternatively, to load the driver as a
module at boot time, place the following line in
.Xr loader.conf 5 :
.Bd -literal -offset indent
uplcom_load="YES"
.Ed
.Sh DESCRIPTION
The
.Nm
driver provides support for various serial adapters based on the Prolific
PL-2303, PL-2303X and PL-2303HX USB-to-RS232 Bridge chips.
.Pp
The device is accessed through the
.Xr ucom 4
driver which makes it behave like a
.Xr tty 4 .
.Sh HARDWARE
The
.Nm
driver supports the following devices:
.Pp
.Bl -bullet -compact
.It
Alcatel One Touch 535/735 phones
.It
Aten UC-232A USB to serial adapter
.It
BAFO BF-800 and BF-810 USB to serial adapters
.It
Belkin F5U257 USB to serial adapter
.It
Elecom UC-SGT USB to serial adapter
.It
HAL Corporation Crossam2+USB IR commander
.It
Hama USB RS-232 serial adapter
.It
Hamlet exagerate XURS232
.It
Huawei UMTS/HSDPA adapters
.It
IOGEAR UC-232A
.It
I/O DATA USB-RSAQ series USB to serial adapters
.It
Itegno GSM/GPRS and CDMA modems
.It
Leadtek 9531 GPS
.It
Mobile Action MA-620 IrDA
.It
Nokia CA-42 USB data cable clones
.It
Panasonic TYTP50P6S 50" touch panel
.It
Pharos 360 GPS
.It
PLANEX USB-RS232 URS-03
.It
Radio Shack USB to serial cable
.It
RATOC REX-USB60 USB to serial adapter
.It
Sagem USB data cables
.It
Samsung I330 smartphone cradle
.It
Sandberg USB to Serial Link (model number 133-08)
.It
Siemens SX1 cellphone
.It
Siemens x65 and x75 series cellphones
.It
Sitecom USB to serial cable
.It
Sony-Ericsson (Susteen) DCU-10 and DCU-11 USB data cables
.It
Sourcenext KeikaiDenwa 8 (with and without charger)
.It
Susteen Datapilot Universal-2 Phone Cable
.It
Syntech CPT-8001C barcode scanner USB IR cradle
.It
TDK USB-PHS adapter UHA6400
.It
TDK USB-PDC adapter UPA9664
.It
Tripp-Lite U209-000-R USB to serial cable
.It
Willcom W-SIM DD PHS terminal (WS002IN)
.El
.Pp
The list is far from being complete and the
.Nm
driver provides support for many more devices based on original Prolific
chips or it's clones:
.Pp
.Bl -bullet -compact
.It
Alcor AU9720 USB to serial controller
.It
Anchor Chips USB to serial controller
.It
Speed Dragon Multimedia MS3303H USB to serial controller
.El
.Sh SEE ALSO
.Xr tty 4 ,
.Xr ucom 4 ,
.Xr usb 4
.Sh HISTORY
The
.Nm
driver
appeared in
.Nx 1.6 .
This manual page was adopted from
.Nx
by
.An Tom Rhodes Aq Mt trhodes@FreeBSD.org
in April 2002.
