DragonFlyBSD/DragonFlyBSD/share/man/man4/uslcom.4
.\"	$OpenBSD: uslcom.4,v 1.4 2007/02/17 01:47:47 jsg Exp $
.\"
.\" Copyright (c) 2006 Jonathan Gray <jsg@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd August 15, 2007
.Dt USLCOM 4
.Os
.Sh NAME
.Nm uslcom
.Nd Silicon Laboratories CP2101, CP2102 and CP2103 USB to serial bridge
.Sh SYNOPSIS
To compile this driver into the kernel,
place the following lines in your
kernel configuration file:
.Bd -ragged -offset indent
.Cd "device uslcom"
.Cd "device ucom"
.Ed
.Pp
Alternatively, to load the driver as a
module at boot time, place the following line in
.Xr loader.conf 5 :
.Bd -literal -offset indent
uslcom_load="YES"
.Ed
.Sh DESCRIPTION
The
.Nm
driver supports devices based on Silicon Laboratories CP2101, CP2102 and
CP2103 USB to serial bridges.
.Pp
The following devices should work with the
.Nm
driver:
.Bl -bullet -compact
.It
Argussoft In-System Programmer
.It
Baltech card reader
.It
Burnside Telecom Desktop Mobile
.It
chip45.com Crumb128 module
.It
Enfora EDG1228 EDGE modem
.It
Helicomm IP-Link 1220-DVM
.It
Jablotron PC-60B
.It
Lipowsky Baby-JTAG
.It
Lipowsky Baby-LIN
.It
Lipowsky HARP-1
.It
Pololu USB to serial adapter
.It
Suunto USB to serial adapter
.It
Tracient RFID readers
.It
West Mountain Radio RIGblaster
.It
West Mountain Radio RIGtalk
.El
.Sh SEE ALSO
.Xr tty 4 ,
.Xr ucom 4 ,
.Xr usb 4
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 4.0
and was imported into
.Dx 1.11 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Jonathan Gray Aq Mt jsg@openbsd.org .
.Sh CAVEATS
Setting hardware flow control is not tested.
.Pp
Silicon Laboratories don't release any programming information
on their products.
