DragonFlyBSD/DragonFlyBSD/share/man/man4/vn.4
.\"	$NetBSD: vnd.4,v 1.1 1995/12/30 18:10:48 thorpej Exp $
.\"
.\" Copyright (c) 1995 Jason R. Thorpe.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed for the NetBSD Project
.\"	by Jason R. Thorpe.
.\" 4. Neither the name of the author nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD: src/share/man/man4/vn.4,v 1.6.2.4 2002/04/15 05:48:55 asmodai Exp $
.\" $DragonFly: src/share/man/man4/vn.4,v 1.6 2007/06/14 21:16:13 swildner Exp $
.\"
.Dd September 28, 2009
.Dt VN 4
.Os
.Sh NAME
.Nm vn
.Nd vnode disk driver
.Sh SYNOPSIS
.Cd pseudo-device vn Op n
.Pp
Alternatively, to load the driver as a module at boot time, place the
following line in
.Pa /boot/loader.conf :
.Bd -literal -offset indent
vn_load="YES"
.Ed
.Sh DESCRIPTION
The
.Nm
driver uses swap or a file as backing store to abstract-out a
device which may then be used like a disk.
The
.Nm
driver supports both labeled and unlabeled pseudo-disks and is useful for
a variety of applications, including swap files and building mini-root,
floppy, or CD-ROM disk images.
.Nm
may also be used to create temporary swap-backed filesystems, such as
.Pa /tmp ,
in a somewhat less memory-hungry manner than MFS.
.Pp
The
.Nm
driver supports autocloning. By default 4
.Nm
devices are also precreated.
.Sh FILES
.Bl -tag -width "Pa /dev/vn*" -compact
.It Pa /dev/vn*
.Nm
device special files
.El
.Sh SEE ALSO
.Xr fsck 8 ,
.Xr mount 8 ,
.Xr mount_mfs 8 ,
.Xr newfs 8 ,
.Xr vnconfig 8
.Sh HISTORY
The vnode disk driver was originally written at the University of
Utah and was substantially modified by
.Fx
developers to add swap-backed support.
.Sh BUGS
The
.Nm
driver does not work if the file does not reside in a local filesystem.
