DragonFlyBSD/DragonFlyBSD/libexec/getty/ttys.5
.\" Copyright (c) 1985, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     from: @(#)ttys.5	8.1 (Berkeley) 6/4/93
.\" $FreeBSD: head/libexec/getty/ttys.5 330277 2018-03-02 14:16:19Z trasz $
.\"
.Dd September 20, 2023
.Dt TTYS 5
.Os
.Sh NAME
.Nm ttys
.Nd terminal initialization information
.Sh DESCRIPTION
The file
.Nm
contains information that is used by various routines to initialize
and control the use of terminal special files.
This information is read with the
.Xr getttyent 3
library routines.
There is one line in the
.Nm
file per special device file.
Fields are separated by tabs and/or spaces.
Fields comprised of more than one word should be enclosed in
double quotes
.Pq \&" .
Blank lines and comments may appear anywhere in the file;
comments are delimited by hash marks
.Pq #
and new lines.
Any unspecified fields will default to null.
.Pp
The first field is normally the
name of the terminal special file as it is found in
.Pa /dev .
However, it can be any arbitrary string
when the associated command is not related to a tty.
.Pp
The second field of the file is the command to execute for the line,
usually
.Xr getty 8 ,
which initializes and opens the line, setting the speed, waiting for
a user name and executing the
.Xr login 1
program.
It can be, however, any desired command, for example
the start up for a window system terminal emulator or some other
daemon process, and can contain multiple words if quoted.
.Pp
The third field is the type of terminal usually connected to that
tty line, normally the one found in the
.Xr termcap 5
data base file.
The environment variable
.Ev TERM
is initialized with the value by
either
.Xr getty 8
or
.Xr login 1 .
.Pp
The remaining fields set flags in the
.Fa ty_status
entry (see
.Xr getttyent 3 ) ,
specify a window system process that
.Xr init 8
will maintain for the terminal line, optionally determine the
type of tty (whether dialup, network or otherwise),
or specify a tty group
name that allows the login class database (see
.Xr login.conf 5 )
to refer to many ttys as a group, to selectively allow or
deny access or enable or disable accounting facilities for
ttys as a group.
.Pp
The following flag values are supported:
.Bl -tag -width "ifconsole" -offset indent
.It on
Enable the tty entry so that
.Xr init 8
should execute the command given in the second field.
.It off
Disable the tty entry.
.It ifconsole
Disable the tty entry if it is not the console.
That is, you can construct a tty entry with both this flag and the
.Dq on
flag to make it only active if that tty is the console.
.It ifexists
Disable the tty entry if it doesn't exist.
.It secure
If the
.Dq on
flag is specified, this flag allows users with a uid of 0
to login on this line.
.It dialup
Indicate that the tty entry describes a dialup line.
.It network
Indicate that the tty entry provides a network connection.
.El
.Pp
Either of these flag values may also be specified in the
terminal type field.
.Pp
The string
.Dq window=
may be followed by a quoted command string which
.Xr init 8
will execute
.Em before
starting the command specified by the second field.
.Pp
The string
.Dq group=
may be followed by a group name comprised of
alphanumeric characters that can be used by
.Xr login.conf 5
to refer to many tty lines as a group to enable or disable access
and accounting facilities.
If no group is specified, then the tty becomes a member of the group
.Dq none .
For backwards compatibility, the
.Dq group=
should appear last on the line, immediately before the optional comment.
.Pp
Both the second field and any command specified with
.Dq window=
will be split into words and executed using
.Xr execve 2 .
Words are separated by any combinations of tabs and spaces.
Arguments containing whitespace should be enclosed in single quotes
.Pq ' .
Note that no shell-style globbing or other variable substitution occurs.
.Sh FILES
.Bl -tag -width /etc/ttys -compact
.It Pa /etc/ttys
.El
.Sh EXAMPLES
.Bd -literal
# root login on console at 1200 baud
console	"/usr/libexec/getty std.1200"	vt100	on secure
# dialup at 1200 baud, no root logins
ttyd0	"/usr/libexec/getty d1200"	dialup	on group=dialup	# 555-1234
# dialup at 115200 baud, enable only if it's the console
ttyd1	"/usr/libexec/getty std.115200"	dialup	on secure ifconsole
# Mike's terminal: hp2621
ttyh0	"/usr/libexec/getty std.115200"	hp2621-nl	on group=dialup	# 457 Evans
# John's terminal: vt100
ttyh1	"/usr/libexec/getty std.115200"	vt100	on group=dialup		# 459 Evans
# terminal emulate/window system
ttyv0	"/usr/local/bin/xterm -display :0"	xterm	on window="/usr/local/bin/X :0"
# enable the video tty only if it exists
ttyv1	"/usr/libexec/getty Pc"		cons25	on secure ifexists
.Ed
.Sh SEE ALSO
.Xr login 1 ,
.Xr getttyent 3 ,
.Xr gettytab 5 ,
.Xr login.conf 5 ,
.Xr termcap 5 ,
.Xr getty 8 ,
.Xr init 8 ,
.Xr pstat 8
.\".Xr ttyflags 8
.Sh HISTORY
A
.Nm
file appeared in
.At v6 .
