DragonFlyBSD/DragonFlyBSD/sbin/diskinfo/diskinfo.8
.\" Copyright (c) 2007 The DragonFly Project.  All rights reserved.
.\"
.\" This code is derived from software contributed to The DragonFly Project
.\" by Matthew Dillon <dillon@backplane.com>
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\"
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in
.\"    the documentation and/or other materials provided with the
.\"    distribution.
.\" 3. Neither the name of The DragonFly Project nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific, prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
.\" LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
.\" FOR A PARTICULAR PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE
.\" COPYRIGHT HOLDERS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
.\" OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $DragonFly: src/sbin/diskinfo/diskinfo.8,v 1.1 2007/05/15 17:53:11 dillon Exp $
.\"
.Dd February 8, 2009
.Dt DISKINFO 8
.Os
.Sh NAME
.Nm diskinfo
.Nd extract block IO management info for a disk, slice, or partition
.Sh SYNOPSIS
.Nm
.Op Fl qx
.Ar device ...
.Sh DESCRIPTION
The
.Nm
utility extracts information from block media devices such as raw disks,
slices, and partitions.
The block size (aka sector size), disk offset, and disk size,
in bytes, is returned for each device.
Offsets are relative to the base of the raw disk, not the base of
the slice or partition.
.Pp
The options are as follows:
.Bl -tag -width indent
.It Fl q
Quiet operation.
.It Fl x
Extended information.
.El
.Sh EXAMPLES
.Dl "diskinfo /dev/da0*"
.Sh SEE ALSO
.Xr disklabel 5 ,
.Xr fdisk 8
.Sh HISTORY
The
.Nm
command first appeared in
.Dx 1.9 .
