Repository: DragonFlyBSD/DragonFlyBSD
Catalog: contrib/bsdinstaller-1.1.6/src/backend/lua/po/*.po
Languages: ru

source: The installer could not find any disks suitable for installation (IDE or SCSI) attached to this computer. If you wish to install %s on an unorthodox storage device, you will have to exit to a LiveCD command prompt and install it manually, using the file /README as a guide.
ru: Программа установки не может найти на этом компьютере диски, подходящие для установки (IDE или SCSI). Если вы хотите установить %s на другое устройство, необходимо выйти в приглашение командной строки LiveCD и провести установку вручную, используя файл /README в качестве руководства.

source: The installer could not find any suitable disks attached to this computer. If you wish to configure an installation of %s on an unorthodox storage device, you will have to exit to a LiveCD command prompt and configure it manually, using the file /README as a guide.
ru: Программа установки не смогла найти ни одного подходящего диска на этом компьютере. Если вы хотите настроить установку %s на другом устройстве хранения, вам потребуется выйти в приглашение командной строки LiveCD и настроить это устройство вручную, используя файл /README в качестве руководства.

source: The installer could not find any suitable disks attached to this computer. If you wish to upgrade an installation located on an unorthodox storage device, you will have to exit to a LiveCD command prompt and configure it manually, using the file /README as a guide.
ru: Программа установки не смогла найти ни одного подходящего диска на этом компьютере. Если вы хотите обновить установку на другом устройстве хранения, вам потребуется выйти в приглашение командной строки LiveCD и настроить это устройство вручную, используя файл /README в качестве руководства.

source: The name of the login group contains illegal characters.
ru: Имя группы содержит недопустимые символы.

source: The passwords do not match.
ru: Пароли не совпадают.

source: The root password has been changed.
ru: Пароль root был изменен.

source: The selected shell does not exist on the system.
ru: Выбранная оболочка не установлена в системе.

source: The target system could not be successfully mounted.
ru: Целевая файловая система не может быть смонтирована.

source: The target system could not be successfully probed.
ru: Целевая файловая система не может быть протестирована.

source: The text specified in the Real Name field contains illegal characters.
ru: Текст в поле 'Полное имя' содержит недопустимые символы.

source: The time and date have successfully been set.
ru: Время и дата были успешно установлены.

source: The username contains illegal characters.
ru: Имя пользователя содержит недопустимые символы.

source: There are no packages installed on this system.
ru: В системе нет установленных пакетов.

source: There were errors. Some packages may not have been successfully removed.
ru: Произошли ошибки. Некоторые пакеты могли быть не удалены.

source: This experimental application will install %s on one of the hard disk drives attached to this computer. It has been designed to make it easy to install %s in the typical case. If you have special requirements that are not addressed by this installer, or if you have problems using it, you are welcome to install %s manually. To do so select Exit to Live CD, login as root, and follow the instructions given in the file /README . NOTE! As with any installation process, YOU ARE STRONGLY ENCOURAGED TO BACK UP ANY IMPORTANT DATA ON THIS COMPUTER BEFORE PROCEEDING!
ru: Эта экспериментальная программа установит %s на один из подключенных к компьютеру жестких дисков. Она была разработана для упрощения типичной установки %s. Если вы предъявляете к установке особые требования, не удовлетворяемые этой программой, или у вас проблемы с ее использованием, установите %s вручную. Для этого выйдите из Live CD, войдите под root, и следуйте инструкциям в файле /README . ВНИМАНИЕ! Как и с любым процессом установки, НАСТОЯТЕЛЬНО РЕКОМЕНДУЕТСЯ СДЕЛАТЬ РЕЗЕРВНУЮ КОПИЮ ВСЕХ ВАЖНЫХ ДАННЫХ ПЕРЕД НАЧАЛОМ УСТАНОВКИ!

source: This machine is about to be shut down. After the machine has reached its shutdown state, you may remove the CD from the CD-ROM drive tray and press Enter to reboot from the HDD.
ru: Компьютер будет перезагружен. После завершения работы системы вы можете извлечь компакт-диск из привода и нажать Enter для загрузки с жесткого диска.

source: UTC Time
ru: Время UTC

source: Upgrade a system with to the newest available version
ru: Обновление системы до последней доступной версии

source: Upgrade an Installed System
ru: Обновление установленной системы

source: User ID
ru: ID пользователя

source: User `%s' was added.
ru: Пользователь `%s' был добавлен

source: User was not successfully added.
ru: Пользователь не был добавлен

source: Username
ru: Имя пользователя

source: WARNING! ALL data in primary partition #%d, %s on the disk %s will be IRREVOCABLY ERASED! Are you ABSOLUTELY SURE you wish to take this action? This is your LAST CHANCE to cancel!
ru: ВНИМАНИЕ! ВСЕ данные основного раздела #%d, %s на диске %s будут НЕВОССТАНОВИМО УДАЛЕНЫ! Вы АБСОЛЮТНО УВЕРЕНЫ, что хотите выполнить это действие? Это ПОСЛЕДНИЙ ШАНС отменить действие!

source: WARNING: The total number of sectors needed for the requested partitions (%d) exceeds the number of sectors available on the disk (%d) by %d sectors (%s.) This is an invalid configuration; we recommend shrinking the size of one or more partitions before proceeding. Proceed anyway?
ru: ВНИМАНИЕ: Общее количество секторов, необходимых для выбранных разделов (%d) превышает количество секторов, доступных на диске (%d) на %d секторов (%s.) Это неверная конфигурация; мы рекомендуем урезать размер одного или более разделов перед тем, как продолжить. Продолжить несмотря на это?

source: WARNING: The total number of sectors needed for the requested subpartitions (%d) exceeds the number of sectors available in the partition (%d) by %d sectors (%s.) This is an invalid configuration; we recommend shrinking the size of one or more subpartitions before proceeding. Proceed anyway?
ru: WARNING: The total number of sectors needed for the requested subpartitions (%d) exceeds the number of sectors available in the partition (%d) by %d sectors (%s.) This is an invalid configuration; we recommend shrinking the size of one or more subpartitions before proceeding. Proceed anyway?ВНИМАНИЕ: Общее количество секторов, необходимых для выбранных подразделов (%d) превышает количество секторов, доступных в разделе (%d) на %d секторов (%s.) Это неверная конфигурация; мы рекомендуем урезать размер одного или более подразделов перед тем, как продолжить. Продолжить несмотря на это?

source: WARNING: the %s subpartition should be at least %s in size or you will risk running out of space during the installation. Proceed anyway?
ru: ВНИМАНИЕ: подраздел %s должен иметь размер как минимум %s, или будет риск нехватки места при установке. Продолжить несмотря на это?

source: WARNING: you should have a disk at least %dM in size, or you may encounter problems trying to install %s.
ru: ПРЕДУПРЕЖДЕНИЕ: диск должен иметь размер как минимум %dM, или у вас могут возникнуть проблемы при установке %s.

source: WARNING: you should have a primary partition at least %dM in size, or you may encounter problems trying to install %s.
ru: ПРЕДУПРЕЖДЕНИЕ: размер основного раздела должен быть не менее %dM, или при установке %s могут возникнуть проблемы.

source: Waiting for interface %s to come up.
ru: Ожидание подъема интерфейса %s.

source: Warning: already-mounted target system could not be correctly unmounted first.
ru: Внимание: смонтированная файловая система не может быть корректно размонтирована.

source: Warning: subpartitions were not correctly unmounted.
ru: Предупреждение: подразделы не были правильно отмонтированы.

source: Would you like to try dynamically configuring this interface? (This requires that you have a DHCP server operating on the network that this interface is attached to.)
ru: Хотите ли вы включить динамическое конфигурирование интерфейса? (Это требует наличия DHCP сервера в сети, к которой подключен этот сетевой интерфейс).

source: Year
ru: Год

source: You have elected to not have the following subpartition(s): %s The ramifications of these subpartition(s) being missing will be: %s Is this really what you want to do?
ru: Вы отказались от создания следующих подразделов: %s Эти подразделы будут заменены так: %s Вы действительно подтверждаете это?

source: You have not yet configured your network settings. Would you like to do so now? (Having an operational network connection will enhance the ability of subsequent tasks, such as installing.
ru: Вы еще не настроили сеть. Хотите ли вы сделать это сейчас? (Наличие работающего сетевого подключения добавит возможностей последующим задачам, таким как установка.

source: You may now format and partition this disk if you desire. If this is a brand new disk, you should do this. If you would like to place multiple operating systems on this disk, you should create multiple partitions, one for each operating system. If this disk already has operating systems on it that you wish to keep, you should NOT do this, and should skip this step. Format and partition this disk?
ru: Теперь вы можете отформатировать и разбить на разделы диск. Если это новый диск, сделайте это. Если вы хотите поместить на этот диск несколько операционных систем, вам потребуется создать несколько разделов, по одному на каждую операционную систему. Если на диске уже находится операционная система, которую вы хотите сохранить, НЕ делайте этого и пропустите этот шаг. Отформатировать диск и разбить его на разделы?

source: You may now wish to install bootblocks on one or more disks. If you already have a boot manager installed, you can skip this step (but you may have to configure your boot manager separately.) If you installed %s on a disk other than your first disk, you will need to put the bootblock on at least your first disk and the %s disk.
ru: Вы можете установить загрузочные блоки на один или несколько дисков. Если менеджер загрузки уже установлен, этот шаг можно пропустить (но менеджер загрузки необходимо настроить отдельно). Если %s устанавливается не на первый диск, загрузочный блок необходимо поместить хотя бы на первый диск и диск с %s.

source: You must enter a username.
ru: Необходимо ввести имя пользователя
