Repository: DragonFlyBSD/DragonFlyBSD
Catalog: contrib/bsdinstaller-1.1.6/src/backend/lua/po/*.po
Languages: ru

source: %d/%d packages were successfully installed!
ru: %d/%d пакетов было успешно установлено на диск!

source: %d/%d packages were successfully removed!
ru: %d/%d пакетов было успешно удалено!

source: %s is now installed
ru: %s установлена

source: %s was not fully installed.
ru: %s не была полностью установлена.

source: %s will be a plain dir in %s
ru: %s будет обычным каталогом в %s

source: %s will be symlinked to %s
ru: %s будет символической ссылкой на %s

source: '%s' is not a recognized partition type. Please use a numeric identifier if you wish to use an unlisted partition type.
ru: '%s' не является известным типом раздела. Если вы хотите ввести не входящий в список тип раздела, используйте числовой идентификатор.

source: 'Packet Mode' refers to using newer BIOS calls to boot from a partition of the disk. It is generally not required unless: - your BIOS does not support legacy mode; or - your %s primary partition resides on a cylinder of the disk beyond cylinder 1024; or - you just can't get it to boot without it.
ru: 'Packet Mode' означает использование новых функций BIOS для загрузки с дискового раздела. Обычно он не требуется, если только: - BIOS не поддерживает legacy режим; или - основной раздел %s находится на цилиндре диска с номером больше 1024; или - вы просто не можете загрузиться без него.

source: A failure occured while provisioning the NetBoot environment. Please consult the log file for details.
ru: При подготовке NetBoot произошли ошибки. Обратитесь к лог файлам за детальной информацией.

source: Accept and Add User
ru: Принять и добавить пользователя

source: Accept and Create
ru: Принять и создать

source: Accept and Install Bootblocks
ru: Подтвердить и установить загрузочный блок

source: Accept and Set Password
ru: Принять и установить пароль

source: Accept these Packages
ru: Принять эти пакеты

source: Action cancelled - no primary partitions were formatted.
ru: Действие прервано - нет отформатированных основных разделов.

source: Active?
ru: Активно?

source: Add User
ru: Добавить пользователя

source: An error occurred when setting the root password.
ru: При установке пароля root произошла ошибка.

source: An error occurred while attempting to set time and date.
ru: При попытке установить время и дату произошла ошибка.

source: Assign IP Address
ru: Присвоение IP адреса

source: Begin Installation
ru: Начало установки

source: Begin Installing Files
ru: Начало установки файлов

source: Block Size
ru: Размер блока

source: Calculating package dependencies.
ru: Определение зависимостей пакетов.

source: Cancel
ru: Отмена

source: Capacity
ru: Емкость

source: Capacity must either end in 'M' for megabytes, 'G' for gigabytes, or be '*' to indicate 'use all remaining space.'
ru: Емкость может состоять из цифры и буквы 'M' для мегабайт, 'G' для гигабайт, а '*' означает 'использовать все оставшееся место'.

source: Change Console Settings
ru: Изменение установок консоли

source: Choose Target System
ru: Выбор целевой системы

source: Choose one of the following things to configure.
ru: Выберите один из следующих пунктов настройки.

source: Configure
ru: Настройка

source: Configure Interface
ru: Настройка интерфейса

source: Configure a %s OS that has already been installed
ru: Настройка установленной ОС %s

source: Configure a System on Disk
ru: Настройка системы на диске

source: Configure an Installed System
ru: Настройка установленной системы

source: Configure the Running System
ru: Настройка работающей системы

source: Configure the system that was just installed
ru: Настройка только что установленной системы

source: Configuring Interface:
ru: Настройка интерфейса:

source: Congratulations, %s is now installed on your hard drive! You may now do one of three things: you can perform some initial configuration of this system, you can reboot to test out your new installation, or you can go back to the main menu and select other actions to perform.
ru: Поздравляем, %s только что была установлена на жесткий диск! Теперь вы можете выбрать: выполнение первоначальной настройки системы, перезагрузку для тестирования новой установки, или возврат в главное меню для выполнения каких-либо других действий.

source: Could not create the skeletal target system.
ru: Не могу создать целевую (skeletal) файловую систему.

source: Could not mount the skeletal target system.
ru: Не могу смонтировать целевую (skeletal) файловую систему.

source: Day
ru: День

source: Default Router
ru: Шлюз по умолчанию

source: Disk Drive
ru: Диск

source: Domain Name
ru: Имя домена

source: Edit Partitions
ru: Редактирование разделов

source: Enable NetBoot Installation Services
ru: Включение сервисов установки NetBoot

source: Enable NetBoot Installation Services?
ru: Включить сервисы установки NetBoot?

source: English
ru: Английский

source: Enter a comma-separated list of other groups that this user should belong to
ru: Введите разделенный запятыми список других групп пользователя

source: Enter the IP Address you would like to use
ru: Введите IP адрес, который будет использоваться

source: Enter the IP address of primary DNS Server
ru: Введите IP адрес первичного DNS сервера

source: Enter the IP address of the default router
ru: Введите IP адрес шлюза по умолчанию

source: Enter the current date and time of day to set this computer's internal timekeeping clock.
ru: Введите текущие дату и время, чтобы установить внутренние часы компьютера.

source: Enter the current day of month (e.g. `30')
ru: Введите день (например, `30')

source: Enter the current hour (e.g. `07')
ru: Введите час (например, `07')

source: Enter the current minute (e.g. `59')
ru: Введите минуту (например, `59')

source: Enter the current month (e.g. `07')
ru: Введите месяц (например, `07')

source: Enter the current year (e.g. `2004')
ru: Введите год (например, `2004')

source: Enter the full path to the user's home directory, or leave blank
ru: Введите полный путь к домашнему каталогу пользователя или оставьте поле пустым

source: Enter the full path to the user's shell program
ru: Введите полный путь к оболочке пользователя

source: Enter the netmask of the IP address
ru: Введите сетевую маску для IP адреса

source: Enter the primary group for this account, or leave blank
ru: Введите основную группу этой учетной записи или оставьте поле пустым

source: Enter the real name (or GECOS field) of this user
ru: Введите полное имя (или поле GECOS) этого пользователя

source: Enter the root password you would like to use
ru: Введите пароль root

source: Enter the same password again to confirm
ru: Введите тот же пароль еще раз для подтверждения

source: Enter the user's password (will not be displayed)
ru: Введите пароль пользователя (не будет отображаться)

source: Enter the username the user will log in as
ru: Введите имя пользователя

source: Enter this account's numeric user id, or leave blank
ru: Введите числовой идентификатор этой учетной записи или оставьте поле пустым

source: Errors occurred while installing packages. Some packages may not have been successfully installed.
ru: При установке пакетов возникли ошибки. Некоторые пакеты могли быть не установлены.

source: Errors occurred; keyboard map was not successfully set.
ru: Возникли ошибки; раскладка клавиатуры не была установлена.

source: Errors occurred; screen map was not successfully set.
ru: Возникли ошибки; параметры экрана не были установлены.

source: Errors occurred; video font was not successfully set.
ru: Возникли ошибки; видео шрифт не был установлен.

source: Everything is now ready to install the actual files which comprise the %s operating system on the selected partition of the selected disk. Note that this process will take quite a while to finish. You may wish to take a break now and come back to the computer in a short while.
ru: Все готово к установке файлов %s на выбранный раздел выбранного диска. Этому процессу потребуется некоторое время. Вы можете сделать перерыв и вернуться к компьютеру через некоторое время.

source: Failed to make sure that the partition is bootable.
ru: Не удалось проверить, загружаем ли раздел.

source: Format and Partition Disk
ru: Форматирование и разбиение диска на разделы

source: Frag Size
ru: Размер фрагмента

source: Full Name of Package
ru: Полное имя пакета

source: Group Memberships
ru: Принадлежность группам

source: Here you can add a user to an installed system. You can leave the Home Directory, User ID, and Login Group fields empty if you want these items to be automatically allocated by the system.
ru: Здесь вы можете добавить пользователя в установленную систему. Вы можете оставить поля 'Домашний каталог', 'ID пользователя' и 'Группа' пустыми, если хотите, чтобы эти значения были автоматически выделены системой.

source: Here you can set the super-user (root) password.
ru: Здесь вы можете установить пароль суперпользователя (root).

source: Home Directory
ru: Домашний каталог

source: Hostname
ru: Имя хоста

source: Hour
ru: Час

source: IP Address
ru: IP адрес

source: Install %s
ru: Установка %s

source: Install %s on this computer system
ru: Установка %s на этот компьютер

source: Install Bootblock(s)
ru: Установка загрузочных блоков

source: Install Bootblock?
ru: Установить загрузочный блок?

source: Install Packages
ru: Установка пакетов

source: Install a bootblock on this disk
ru: Установка загрузочного блока на диск

source: Install these Packages
ru: Установка пакетов

source: Install?
ru: Установить?

source: Interface %s failed to come up.
ru: Интерфейс %s поднять не удалось.

source: Interface %s is now up, with IP address %s.
ru: Интерфейс %s поднят, IP адрес %s.

source: Is this machine's internal clock set to local time or UTC (Universal Coordinated Time, roughly the same as Greenwich Mean Time)? If you don't know, assume local time for now.
ru: Установлены ли часы этого компьютера в локальное время, или в UTC (Universal Coordinated Time, примерно то же, что и Greenwich Mean Time)? Если вы не знаете, выберите локальное время.

source: Local Time
ru: Локальное время

source: Local or UTC (Greenwich Mean Time) clock
ru: Локальные или UTC (Greenwich Mean Time) часы

source: Login Group
ru: Группа

source: Make this computer a boot server for other machines on the network
ru: Сделать этот компьютер загрузочным сервером для других компьютеров в сети

source: Minute
ru: Минута

source: Month
ru: Месяц

source: Mountpoint
ru: Точка монтирования

source: NetBoot Installation Services allow this machine to become an Installation Server that will allow other machines on this network to boot as PXE clients, and will start the Installation Environment on them. *NOTE!* This will assign the IP Address of 10.1.0.1/24 to the selected interface. Would you like to provision this machine to serve up the Installation Environment to other machines?
ru: Сервисы установки NetBoot позволяют этому компьютеру стать сервером установки, что позволить другим компьютерам в этой сети загружаться в качестве PXE клиентов, и запускать на них среду установки. *ВНИМАНИЕ!* Выбранному интерфейсу будет присвоен IP адрес 10.1.0.1/24. Хотите ли вы сделать этот компьютер провайдером среды установки для других компьютеров?

source: NetBoot installation services are now started.
ru: NetBoot сервис установки был запущен.

source: Netmask
ru: Сетевая маска

source: No thanks
ru: Нет, спасибо

source: No valid partitions were found on this disk. You will have to create at least one in which to install %s.
ru: На этом диске на было найдено ни одного подходящего раздела. Для установки %s потребуется создать хотя бы один раздел.

source: Note: none of the swap subpartitions that you have selected are large enough to hold the contents of memory, and thus cannot be used to hold a crash dump (an image of the computers' memory at the time of failure.) Because this complicates troubleshooting, we recommend that you increase the size of one of your swap subpartitions. Proceed anyway?
ru: Внимание: нет ни одного достаточно большого раздела подкачки, чтобы сохранить содержимое памяти, и следовательно их нельзя использовать для сохранения крэш дампа (образа памяти во время сбоя). Поскольку это усложнит решение проблем, мы рекомендуем увеличить размер разделов подкачки. Продолжить несмотря на это?

source: Note: the total capacity required for the requested subpartitions (%s) does not make full use of the capacity available in the partition (%s.) %d sectors (%s) of space will go unused. You may wish to expand one or more subpartitions before proceeding. Proceed anyway?
ru: Внимание: общий размер, выделяемый под создаваемые подразделы (%s), меньше общего размера, доступного в разделе (%s). %d секторов (%s) не используются. Вы можете увеличить один или более подразделов перед установкой. Продолжить несмотря на это?

source: Note: the total number of sectors needed for the requested partitions (%d) does not make full use of the number of sectors available on the disk (%d.) There will be %d unused sectors (%s.) You may wish to expand one or more partitions before proceeding. Proceed anyway?
ru: Внимание: общее количество секторов, выделяемых под создаваемые разделы (%d), меньше общего количества секторов, доступных на диске (%d). %d секторов не используется (%s). Вы можете увеличить один или более разделов перед установкой. Продолжить несмотря на это?

source: Omit Subpartition(s)
ru: Пропустить подраздел(ы)

source: One or more subpartitions of one or more primary partitions of the selected disk are already in use (they are currently mounted on mountpoints in the filesystem.) You should either unmount them before proceeding, or select a different disk to install %s on.
ru: Один или более подразделов на одном или более первичных разделов выбранного диска уже используются (они смонтированы на точки монтирования файловой системы). Вы должны или размонтировать их перед продолжением, или выбрать для другой диск для установки %s.

source: One or more subpartitions on the selected primary partition already in use (they are currently mounted in the filesystem.) You should either unmount them before proceeding, or select a different partition or disk on which to install %s.
ru: Один или более подразделов на выбранном первичном разделе уже используются (они сейчас смонтированы в файловой системе). Вы должны или размонтировать их перед продолжением, или выбрать другой раздел диска для установки %s.

source: Only one partition may have a capacity of '*'.
ru: Только для одного раздела может быть указан объем '*'.

source: Only one subpartition may have a capacity of '*'.
ru: Только для одного подраздела может быть указан объем '*'.

source: Other Group Memberships
ru: Другие группы

source: Packet mode?
ru: Пакетный режим?

source: Partition Type
ru: Тип раздела

source: Password
ru: Пароль

source: Password (Again)
ru: Пароль (повтор)

source: Please choose which installed system you want to configure.
ru: Выберите, какую установленную систему вы хотите настроить.

source: Please enter numbers within acceptable ranges for year, month, day of month, hour, and minute.
ru: Пожалуйста, введите числа, входящие в диапазоны года, месяца, дня месяца, часа и минуты.

source: Please select the network interface you wish to configure.
ru: Выберите, какой сетевой интерфейс вы хотите настроить.

source: Please select your preferred language.
ru: Выберите предпочитаемый язык.

source: Primary DNS Server
ru: Первичный DNS сервер

source: Primary partition #%d was formatted.
ru: Основной раздел #%d был отформатирован.

source: Primary partition #%d was not correctly formatted, and may now be in an inconsistent state. We recommend re-formatting it before proceeding.
ru: Основной раздел #%d не был корректно отформатирован, и может находиться в поврежденном состоянии. Рекомендуется переформатировать его перед дальнейшими действиями.

source: Re-enter the user's password to confirm
ru: Введите пароль еще раз для подтверждения

source: Re-type Root Password
ru: Введите пароль root еще раз

source: Ready to Install
ru: Все готово к установке

source: Real Name
ru: Полное имя

source: Reboot
ru: Перезагрузка

source: Reboot this computer
ru: Перезагрузка компьютера

source: Remove Packages
ru: Удаление пакетов

source: Remove these Packages
ru: Удаление выбранных пакетов

source: Remove?
ru: Удалить?

source: Return to %s
ru: Возврат в %s

source: Return to Configure Menu
ru: Возврат в меню настройки

source: Return to Create Subpartitions
ru: Возврат к созданию подразделов

source: Return to Main
ru: Возврат в начало

source: Return to Main Menu
ru: Возврат в главное меню

source: Return to Previous Menu
ru: Возврат в предыдущее меню

source: Return to Utilities Menu
ru: Возврат в меню утилит

source: Root Password
ru: Пароль root

source: Select All
ru: Выбрать все

source: Select Component to Configure
ru: Выбор компонента для настройки

source: Select Console Font
ru: Выбор консольного шрифта

source: Select Keyboard Map
ru: Выбор раскладки клавиатуры

source: Select Language
ru: Выбор языка

source: Select Network Interface
ru: Выбор сетевого интерфейса

source: Select None
ru: Не выбирать ничего

source: Select Packages
ru: Выбор пакетов

source: Select Screen Map
ru: Выбор карты экрана

source: Select Subpartitions
ru: Выбор подразделов

source: Select Time Zone
ru: Выбор временной зоны

source: Select a Disk
ru: Выбор диска

source: Select a Partition
ru: Выбор раздела

source: Select a Time Zone appropriate to your physical location.
ru: Выберите временную зону, соответствующую вашему местонахождению

source: Select a disk on which to install %s.
ru: Выбор диска для установки %s.

source: Select a disk.
ru: Выбор диска.

source: Select a font appropriate to your video monitor and language.
ru: Выберите шрифт, соответствующий вашему монитору и языку.

source: Select a keyboard map appropriate to your keyboard layout.
ru: Выберите раскладку клавиатуры

source: Select a mapping for translating characters as they appear on your video console screen.
ru: Выбор карты для трансляции символов на консоль.

source: Select a partition.
ru: Выбор раздела

source: Select the disk on which the installation of %s that you wish to configure resides.
ru: Выберите диск, где находится установка %s, которую вы хотите настроить.

source: Select the disk on which the installation that you wish to upgrade resides.
ru: Выберите диск, где находится установка %s, которую вы хотите обновить.

source: Select the packages you wish to install from the LiveCD onto the HDD.
ru: Выберите пакеты, которые вы хотите установить с LiveCD на HDD.

source: Select the packages you wish to install.
ru: Выберите пакеты, которые вы хотите установить.

source: Select the packages you wish to remove from this system
ru: Выберите пакеты, которые вы хотите удалить из системы.

source: Select the partitions (also known as `slices' in BSD tradition) you want to have on this disk. For Capacity, use 'M' to indicate megabytes, 'G' to indicate gigabytes, or a single '*' to indicate 'use the remaining space on the disk'.
ru: Выберите разделы (в BSD также называемые 'слайсами'), которые вы хотите иметь на этом диске. Объем обозначается цифрой с 'M' для мегабайт, 'G' для гигабайт, а знак '*' означает 'использовать оставшееся пространство на диске'.

source: Select the primary partition of %s (also known as a `slice' in the BSD tradition) on which to install %s.
ru: Выберите основной раздел %s (в BSD также называемый 'слайсом') для установки %s.

source: Select the primary partition of %s on which the installation of %s resides.
ru: Выберите основной раздел %s, где установлена %s.

source: Select the primary partition of %s on which the installation that you wish to upgrade resides.
ru: Выберите основной раздел %s, на котором находится установка, которую вы хотите обновить.

source: Select this to use 'packet mode' to boot the disk
ru: Выберите этот пункт для использования 'пакетного режима' загрузки диска

source: Set Root Password
ru: Установите пароль root

source: Set Time and Date
ru: Установка времени и даты

source: Set Timezone
ru: Установка временной зоны

source: Set up NetBoot Server
ru: Настройка сервера NetBoot

source: Set up the subpartitions (also known as just `partitions' in BSD tradition) you want to have on this primary partition. For Capacity, use 'M' to indicate megabytes, 'G' to indicate gigabytes, or a single '*' to indicate 'use the remaining space on the primary partition'.
ru: Установка подразделов (называемых просто `разделами' по традиции BSD), которые будут находиться на этом основном разделе. Для размера используйте 'M', чтобы обозначить мегабайты, 'G', чтобы обозначить гигабайты, или символ '*', чтобы использовать остаток места на основном разделе.

source: Setting password for user `%s'.
ru: Установка пароля для пользователя `%s'.

source: Shell
ru: Оболочка

source: Skip this Step
ru: Пропуск этого действия

source: Some situations in which you might not wish to use this installer are: - you want to install %s onto a logical/extended partition; - you want to install %s onto a ``dangerously dedicated'' disk; or - you want full and utter control over the install process.
ru: В некоторых ситуациях вы не можете использовать эту программу: - установка %s в логический/расширенный раздел; - установка %s на ``dangerously dedicated'' диск; или - необходим тотальный контроль над процессом установки.

source: Some subpartitions on the selected primary partition are already activated as swap. Since there is no way to deactivate swap in %s once it is activated, in order to edit the subpartition layout of this primary partition, you must first reboot.
ru: Некоторые подразделы на выбранном основном разделе уже были активированы для подкачки. Поскольку в %s нет способа деактивировать подкачку, для редактирования раскладки подразделов этого основного раздела необходимо сначала перегрузиться.

source: Subpartitions further divide a primary partition for use with %s. Some reasons you may want a set of subpartitions are: - you want to restrict how much data can be written to certain parts of the primary partition, to quell denial-of-service attacks; and - you want to speed up access to data on the disk.
ru: Подразделы это дальнейшее разделение основного раздела для использования с %s. Причины, по которым могут потребоваться подразделы: - вы хотите ограничить объем данных, которые могут быть записаны на определенные части основного раздела для остановки DoS атаки; и - вы хотите повысить скорость доступа к данным.

source: Switch to Expert Mode
ru: Переключиться в экспертный режим

source: Switch to Normal Mode
ru: Переключиться в нормальный режим

source: Target system was not successfully upgraded.
ru: Целевая система не была успешно обновлена.

source: Target system was successfully upgraded!
ru: Целевая система была успешно обновлена!

source: The Time Zone has been successfully set to %s.
ru: Временная зона была успешно установлена в %s.

source: The disk on which you wish to install a bootblock
ru: Диск, на который будет установлен загрузочный блок

source: The following installed packages require one or more of the packages you selected, and will also be removed: %s Is this acceptable?
ru: Следующим пакетам требуется один или более выбранных пакетов, и они также будут удалены: %s Удалить их?
