DragonFlyBSD/DragonFlyBSD/libexec/dma/dma.8
.\"
.\" Copyright (c) 2008
.\"	The DragonFly Project.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\"
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in
.\"    the documentation and/or other materials provided with the
.\"    distribution.
.\" 3. Neither the name of The DragonFly Project nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific, prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
.\" LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
.\" FOR A PARTICULAR PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE
.\" COPYRIGHT HOLDERS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
.\" OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $DragonFly: src/libexec/dma/dma.8,v 1.10 2008/09/06 14:17:56 swildner Exp $
.\"
.Dd September 17, 2010
.Dt DMA 8
.Os
.Sh NAME
.Nm dma
.Nd DragonFly Mail Agent
.Sh SYNOPSIS
.Nm
.Op Fl DiOt
.Op Fl A Ns Ar mode
.Op Fl b Ns Ar mode
.Op Fl f Ar sender
.Op Fl L Ar tag
.Op Fl o Ns Ar option
.Op Fl r Ar sender
.Op Fl q Ns Op Ar arg
.Op Ar recipient ...
.Sh DESCRIPTION
.Nm
is a small Mail Transport Agent (MTA), designed for home and office use.
It accepts mails from locally installed Mail User Agents (MUA) and
delivers the mails either locally or to a remote destination.
Remote delivery includes several features like TLS/SSL support and SMTP
authentication.
.Pp
.Nm
is not intended as a replacement for real, big MTAs like
.Xr sendmail 8
or
.Xr postfix 1 .
Consequently,
.Nm
does not listen on port 25 for incoming connections.
.Pp
The options are as follows:
.Bl -tag -width indent
.It Fl A Ns Ar mode
.Fl \&Ac
acts as a compatibility option for sendmail.
.It Fl b Ns Ar mode
.Bl -tag -width indent
.It Fl bp
List all mails currently stored in the mail queue.
.It Fl bq
Queue the mail, but don't attempt to deliver it.
See also the
.Sq DEFER
config file setting below.
.El
.Pp
All other
.Ar mode Ns
s are are ignored.
.It Fl D
Don't run in the background.
Useful for debugging.
.It Fl f Ar sender
Set sender address to
.Ar sender .
.It Fl i
Ignore dots alone on lines by themselves in incoming messages.
This should be set if you are reading data from a file.
.It Fl L Ar tag
Set the identifier used in syslog messages to the supplied
.Ar tag .
This is a compatibility option for sendmail.
.It Fl O
This is a compatibility option for sendmail.
.It Fl o Ns Ar option
Specifying
.Fl oi
is synonymous to
.Fl i .
All other options are ignored.
.It Fl q Ns Op Ar arg
Process saved messages in the queue.
The argument is optional and ignored.
.It Fl r Ar sender
Same as
.Fl f .
.It Fl t
Obtain recipient addresses from the message header.
.Nm
will parse the
.Li To: ,
.Li Cc: ,
and
.Li Bcc:
headers.
The
.Li Bcc:
header will be removed independent of whether
.Fl t
is specified or not.
.El
.Sh CONFIGURATION
.Nm
can be configured with three config files:
.Pp
.Bl -bullet -compact
.It
auth.conf
.It
dma.conf
.It
virtusertable
.El
.Pp
These three files are stored per default in
.Pa /etc/dma .
.Sh FILE FORMAT
Every file contains parameters of the form
.Sq name value .
Lines containing boolean values are set to
.Sq NO
if the line is commented and to
.Sq YES
if the line is uncommented.
Empty lines or lines beginning with a
.Sq #
are ignored.
Parameter names and their values are case sensitive.
.Sh PARAMETERS
.Ss auth.conf
SMTP authentication can be configured in
.Pa auth.conf .
Each line has the format
.Dq Li user|smarthost:password .
.Ss dma.conf
Most of the behaviour of
.Nm
can be configured in
.Pa dma.conf .
.Bl -tag -width 4n
.It Ic SMARTHOST Xo
(string, default=empty)
.Xc
If you want to send outgoing mails via a smarthost, set this variable to
your smarthosts address.
.It Ic PORT Xo
(numeric, default=25)
.Xc
Use this port to deliver remote emails.
Only useful together with the
.Sq SMARTHOST
option, because
.Nm
will deliver all mails to this port, regardless of whether a smarthost is set
or not.
.It Ic ALIASES Xo
(string, default=/etc/mail/aliases)
.Xc
Path to the local aliases file.
Just stick with the default.
.It Ic SPOOLDIR Xo
(string, default=/var/spool/dma)
.Xc
Path to
.Nm Ap s
spool directory.
Just stick with the default.
.It Ic VIRTPATH Xo
(string, default=/etc/dma/virtusertable)
.Xc
Path to the
.Sq virtusertable
file.
.It Ic AUTHPATH Xo
(string, default=/etc/dma/auth.conf)
.Xc
Path to the
.Sq auth.conf
file.
.It Ic VIRTUAL Xo
(boolean, default=commented)
.Xc
Uncomment if you want virtual user support.
.It Ic SECURETRANS Xo
(boolean, default=commented)
.Xc
Uncomment if you want TLS/SSL secured transfer.
.It Ic STARTTLS Xo
(boolean, default=commented)
.Xc
Uncomment if you want to use STARTTLS.
Only useful together with
.Sq SECURETRANS .
.It Ic CERTFILE Xo
(string, default=empty)
.Xc
Path to your SSL certificate file.
.It Ic SECURE Xo
(boolean, default=commented)
.Xc
Change this entry to
.Sq INSECURE
to use plain text SMTP login over an insecure connection.
You have to rename this variable manually to prevent that you send your
password accidentally over an insecure connection.
.It Ic DEFER Xo
(boolean, default=commented)
.Xc
Uncomment if you want that
.Nm
defers your mail.
You have to flush your mail queue manually with the
.Fl q
option.
This option is handy if you are behind a dialup line.
.It Ic FULLBOUNCE Xo
(boolean, default=commented)
.Xc
Uncomment if you want the bounce message to include the complete original
message, not just the headers.
.It Ic MAILNAME Xo
(string, default=empty)
.Xc
The name to be used when introducing this host, if different from
the result of
.Xr hostname 1 .
If specified, this option overrides
.Sq MAILNAMEFILE .
.It Ic MAILNAMEFILE Xo
(string, default=empty)
.Xc
The name of the file to read the
.Sq MAILNAME
from.
.El
.Ss virtusertable
The
.Pa virtusertable
file specifies a virtual user table.
Each line has the format
.Dq Li localuser:mail-address .
Some smarthosts do not accept mails from unresolvable email address
(e.g.\& user@localhost) so you have to rewrite your outgoing email
address to a valid address.
.Sh SEE ALSO
.Xr mailaddr 7 ,
.Xr mailwrapper 8 ,
.Xr sendmail 8
.Rs
.%A "J. B. Postel"
.%T "Simple Mail Transfer Protocol"
.%O RFC 821
.Re
.Rs
.%A "J. Myers"
.%T "SMTP Service Extension for Authentication"
.%O RFC 2554
.Re
.Rs
.%A "P. Hoffman"
.%T "SMTP Service Extension for Secure SMTP over TLS"
.%O RFC 2487
.Re
.Sh HISTORY
The
.Nm
utility first appeared in
.Dx 1.11 .
.Sh AUTHORS
.Nm
was written by
.An Matthias Schmidt Aq matthias@dragonflybsd.org
and
.An Simon Schubert Aq corecode@dragonflybsd.org .
