DragonFlyBSD/DragonFlyBSD/share/man/man8/dhcp.8
.\"     $OpenBSD: dhcp.8,v 1.24 2008/06/08 03:03:37 jdixon Exp $
.\"
.\"
.\" Copyright (c) 1999 Aaron Campbell
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\"
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd October 15, 2008
.Dt DHCP 8
.Os
.Sh NAME
.Nm dhcp
.Nd configuring DragonFly for DHCP
.Sh DESCRIPTION
The Dynamic Host Configuration Protocol (DHCP) allows hosts on a TCP/IP network
to configure one or more network interfaces based on information collected from
a DHCP server in response to a DHCP request.
This mechanism is often used, for example, by cable modem and DSL network
providers to simplify network configurations for their clients/customers.
.Pp
Information typically contained within a DHCP response includes an IP
address for the interface, subnet mask, broadcast address, router (gateway)
listing, domain name server listing, and the interface's MTU.
.Pp
To set up
.Dx
as a DHCP client:
.Bl -enum -offset indent
.It
For each interface that is to be configured via DHCP, add
.Dq Li DHCP
to the
.Va ifconfig_ Ns Aq Ar interface
variable in
.Pa /etc/rc.conf .
See
.Xr rc.conf 5
for more information on the format of this file.
.Pp
The
.Pa /etc/network.subr
script reads each of these variables at boot-time and runs the
.Xr dhclient 8
program for each interface that is to be configured via DHCP.
.It
[Optional] To tweak settings, edit
.Pa /etc/dhclient.conf .
This file is shipped with the system.
See
.Xr dhclient.conf 5
and
.Xr dhclient 8
for details.
.El
.Pp
To set up
.Dx
as a DHCP server:
.Bl -enum -offset indent
.It
Install
.Xr dhcpd 8
(available in
.Xr dports 7 ) .
.It
Edit
.Pa /usr/local/etc/dhcp/dhcpd.conf .
See
.Xr dhcpd.conf 5
and
.Xr dhcpd 8
for details.
.It
Edit
.Pa /etc/rc.conf
and set
.Cm dhcpd_flags="" .
This will cause
.Dx
to start the
.Xr dhcpd 8
daemon at boot-time and listen for DHCP requests on the local network.
To start it manually, execute the following command:
.Pp
.Dl # /usr/local/sbin/dhcpd [netif1 netif2 ...]
.El
.Pp
The DHCP client and server use the Berkeley Packet Filter (BPF).
Ensure the kernel has been compiled with BPF support
and at least one
.Pa /dev/bpf*
file exists per broadcast network interface that is attached to the system.
This is almost always the case and should only be considered if all other
troubleshooting options have failed.
.Pp
See
.Xr dhcpd 8
for information on other available options.
Note, however, that most of the flags are useful only for debugging purposes.
.Sh FILES
.Bl -tag -width /usr/local/etc/dhcpd.conf
.It Pa /usr/local/etc/dhcp/dhcpd.conf
DHCP server configuration file
.It Pa /etc/rc.conf
configuration file where
DHCP client configuration is set for individual interfaces and
.Cm dhcpd_flags
must be set
.It Pa /etc/dhclient.conf
DHCP client configuration file
.El
.Sh SEE ALSO
.Xr dhclient.conf 5 ,
.Xr dhcpd.conf 5 Pq Pa net/isc-dhcp42-server ,
.Xr dhclient 8 ,
.Xr dhcpd 8 Pq Pa net/isc-dhcp42-server ,
.Xr dhcrelay 8 Pq Pa net/isc-dhcp42-relay
