DragonFlyBSD/DragonFlyBSD/share/man/man8/uefi.8
.\" Copyright (c) 2014 The FreeBSD Foundation
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHORS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHORS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD: head/share/man/man8/uefi.8 295522 2016-02-11 14:45:18Z emaste $
.\"
.Dd September 15, 2026
.Dt UEFI 8
.Os
.Sh NAME
.Nm UEFI
.Nd Unified Extensible Firmware Interface bootstrapping procedures
.Sh DESCRIPTION
The
.Nm
Unified Extensible Firmware Interface provides boot- and run-time services
to operating systems.
.Nm
is a replacement for the legacy BIOS on the i386 and amd64 CPU architectures,
and is also used on arm64 and ia64.
.Pp
The
.Nm
boot process loads system bootstrap code located in an EFI System Partition
(ESP).
The ESP is a GPT or MBR partition with a specific identifier that contains an
.Xr msdos 5
FAT file system with a specified file hierarchy.
.Bl -column -offset indent ".Sy Partition Scheme" ".Sy ESP Identifier"
.It Sy "Partition Scheme" Ta Sy "ESP Identifier"
.It GPT Ta C12A7328-F81F-11D2-BA4B-00A0C93EC93B
.It MBR Ta 0xEF
.El
.Ss Direct loading
Firmware boot entries identify an EFI executable and may supply load
arguments to it.
For x86-64 removable media the fallback executable path is
.Pa /EFI/BOOT/BOOTX64.EFI .
The current installation tools and installation images place
.Pa loader.efi
at this path.
The firmware starts the executable and supplies its source device
handle; interpretation of arguments such as
.Va currdev
is the loader's responsibility.
.Pp
A loader started from an ESP or an EFI CD boot image selects a boot
filesystem before reading startup scripts.
An explicit
.Va currdev
bypasses automatic scanning; an unavailable target enters the loader
command prompt.
Otherwise the loader searches the source filesystem, other partitions on
the same disk, and other EFI devices in enumeration order.
It prefers a startup or configuration marker over merely accessible
filesystems.
See
.Xr loader 8
for the marker paths, supported layouts and one-time configuration
redirection rules.
.Pp
Automatic selection supports GPT whole-partition HAMMER2 with an
uncompressed BOOT PFS, UFS (including disklabel64 UFS partition
.Ql a ) ,
and ISO9660.
An EFI CD boot image is mapped to its outer ISO filesystem, whose
.Pa /boot
directory contains the boot files; the kernel need not be in the EFI
FAT image.
The chosen boot filesystem and the kernel's root filesystem are separate:
.Va currdev
locates boot files, while
.Va vfs.root.mountfrom
selects the root filesystem used by the kernel.
.Ss Existing boot1 installations
Existing installations may retain
.Pa boot1.efi
on the ESP.
It searches for a UFS filesystem containing
.Pa /loader.efi
or
.Pa /boot/loader.efi ,
loads that executable, and passes its filesystem handle and optional
.Pa /boot.config
or
.Pa /boot/config
contents as load arguments.
A loader started from this non-ESP device enters its existing startup
flow without another scan or configuration redirection.
.Ss Updating an ESP executable
Updating
.Pa /boot/loader.efi
does not replace the EFI executable stored on the ESP.
An existing boot1 installation can continue using its two-stage path.
To switch to direct loading, or update an existing direct loader,
mount the correct ESP and replace the executable at the path used by
the firmware boot entry.
For example, if the ESP is already mounted at
.Pa /mnt/esp
and the firmware uses the fallback path:
.Bd -literal -offset indent
cp /boot/loader.efi /mnt/esp/EFI/BOOT/BOOTX64.EFI
.Ed
.Pp
Use the actual executable path when the boot entry names a different one.
Do not rerun
.Xr efisetup 8
for this update: it reformats and repartitions the target drive.
.Sh FILES
.Bl -tag -width /boot/loader -compact
.It Pa /boot/boot1.efi
Optional first-stage bootstrap for existing installations
.It Pa /boot/loader.efi
EFI loader executable
.It Pa /boot/kernel/kernel
default kernel
.It Pa /boot/kernel.old/kernel
typical non-default kernel (optional)
.El
.Sh SEE ALSO
.\".Xr boot.config 5 ,
.Xr efivar 3 ,
.Xr disklabel64 5 ,
.Xr msdos 5 ,
.Xr boot 8 ,
.Xr efibootmgr 8 ,
.Xr efidp 8 ,
.Xr efisetup 8 ,
.Xr efivar 8 ,
.Xr loader 8 ,
.Xr uefisign 8
.Sh HISTORY
.Nm
boot support first appeared in
.Fx 10.1
and was brought into
.Dx 4.5 .
.Sh AUTHORS
.An -nosplit
.Nm
boot support was developed by
.An Benno Rice Aq Mt benno@FreeBSD.org ,
.An \&Ed Maste Aq Mt emaste@FreeBSD.org ,
and
.An Nathan Whitehorn Aq Mt nwhitehorn@FreeBSD.org .
The
.Fx
Foundation sponsored portions of the work.
