DragonFlyBSD/DragonFlyBSD/share/man/man9/BUS_SETUP_INTR.9
.\" Copyright (c) 2000 Jeroen Ruigrok van der Werven
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD: src/share/man/man9/BUS_SETUP_INTR.9,v 1.1.2.6 2001/12/17 11:30:18 ru Exp $
.\" $DragonFly: src/share/man/man9/BUS_SETUP_INTR.9,v 1.3 2005/12/20 13:16:14 swildner Exp $
.\"
.Dd December 20, 2005
.Dt BUS_SETUP_INTR 9
.Os
.Sh NAME
.Nm BUS_SETUP_INTR
.Nd create and attach to an interrupt handler
.Sh SYNOPSIS
.In sys/param.h
.In sys/bus.h
.Ft int
.Fn BUS_SETUP_INTR "device_t dev" "device_t child" "struct resource *irq" "int flags" "driver_intr_t *intr" "void *arg" "void **cookiep" "lwkt_serialize_t serializer"
.Sh DESCRIPTION
The method
.Nm
will create and attach an interrupt handler to an interrupt
previously allocated by the resource manager's
.Xr BUS_ALLOC_RESOURCE 9
method.
The handler
.Fa intr
will be called with the value
.Fa arg
as its only argument.
.Pp
Interrupt flags are typically either
.Li 0
or
.Dv INTR_MPSAFE .
If
.Dv INTR_MPSAFE
is specified the kernel is free to call the interrupt handler without
holding the MP lock.
.Dv INTR_FAST
is also sometimes specified and allows the
interrupt handler to be directly called from the context of the thread
being interrupted, but is not recommended for most drivers.
Other interrupt flags exist for special purposes.
.Pp
If 
.Fa serializer
is non-NULL the interrupt handler will be called with the serializer held.
The serializer replaces the obsolete SPL calls that are no longer relevant on
SMP systems.
Driver code can obtain the same serializer to interlock against
the driver interrupt.
The serializer also has enablement and disablement
features which mainline driver code can use to avoid races between interrupt
disablement and delayed interrupts executing from the device's interrupt
thread.
.Pp
The interrupt handler will be detached by
.Fn BUS_TEARDOWN_INTR .
The cookie will be stored in the pointer
.Fa *cookiep
and needs to be passed to
.Fn BUS_TEARDOWN_INTR
in order to tear down the correct interrupt handler.
.Sh RETURN VALUES
Zero is returned on success,
otherwise an appropriate error is returned.
.Sh SEE ALSO
.Xr BUS_TEARDOWN_INTR 9 ,
.Xr device 9 ,
.Xr driver 9
.Sh AUTHORS
.An -nosplit
This man page was written by
.An Jeroen Ruigrok van der Werven
.Aq asmodai@FreeBSD.org
based on the manpages for BUS_CREATE_INTR and BUS_CONNECT_INTR written by
.An Doug Rabson
.Aq dfr@FreeBSD.org .
