DragonFlyBSD/DragonFlyBSD/share/man/man9/firmware.9
.\" Copyright (c) 2006 Max Laier <mlaier@FreeBSD.org>
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD: src/share/man/man9/firmware.9,v 1.9 2010/04/14 19:08:06 uqs Exp $
.\"
.Dd July 27, 2026
.Dt FIRMWARE 9
.Os
.Sh NAME
.Nm firmware_register ,
.Nm firmware_unregister ,
.Nm firmware_get ,
.Nm firmware_put
.Nd firmware image loading and management
.Sh SYNOPSIS
.In sys/param.h
.In sys/systm.h
.In sys/linker.h
.In sys/firmware.h
.Bd -literal
struct firmware {
	const char	*name;		/* system-wide name */
	const uint8_t	*data;		/* location of image */
	size_t		datasize;	/* size of image in bytes */
	unsigned int	version;	/* version of the image */
};
.Ed
.Ft "const struct firmware *"
.Fo firmware_register
.Fa "const char *imagename"
.Fa "const void *data"
.Fa "size_t datasize"
.Fa "unsigned int version"
.Fa "const struct firmware *parent"
.Fc
.Ft int
.Fn firmware_unregister "const char *imagename"
.Ft "const struct firmware *"
.Fn firmware_get "const char *imagename"
.Ft void
.Fn firmware_put "const struct firmware *fp" "int flags"
.Sh DESCRIPTION
The
.Nm firmware
abstraction provides a convenient interface for loading
.Nm firmware images
into the kernel, and for accessing such images from kernel components.
.Pp
A
.Nm firmware image
(or
.Nm image
for brevity)
is an opaque block of data residing in kernel memory.
It is associated to a unique
.Nm imagename
which constitutes a search key, and to an integer
.Nm version
number, which is also an opaque piece of information for the
firmware subsystem.
.Pp
An image is registered with the
.Nm firmware
subsystem by calling the function
.Fn firmware_register ,
and unregistered by calling
.Fn firmware_unregister .
These functions are usually (but not exclusively) called by
specially crafted kernel modules that contain the firmware image.
The modules can be statically compiled in the kernel, or loaded by
.Nm /boot/loader ,
manually at runtime, or on demand by the firmware subsystem.
.Pp
The firmware subsystem can also obtain an image on its own: from one the
loader preloaded, or by reading a regular file.
See
.Sx FIRMWARE LOADING MECHANISMS
below.
.Pp
.Nm Clients
of the firmware subsystem can request access to a given image
by calling the function
.Fn firmware_get
with the
.Nm imagename
they want as an argument.
If a matching image is not already registered, the firmware subsystem goes
looking for one.
.Pp
A driver names an image and nothing else.
Where that image comes from is a decision made outside the driver - by
whoever installed the firmware and, for the images needed before there is a
filesystem to read, by whoever wrote
.Xr loader.conf 5 .
Adding a source has never required changing a driver and should not.
.Sh API DESCRIPTION
The kernel
.Nm firmware API
is made of the following functions:
.Pp
.Fn firmware_register
registers with the kernel an image of size
.Nm datasize
located at address
.Nm data ,
under the name
.Nm imagename .
.Pp
The function returns NULL on error (e.g. because an
image with the same name already exists, or the image
table is full), or a
.Ft const struct firmware *
pointer to the image requested.
.Pp
.Fn firmware_unregister
tries to unregister the firmware image
.Nm imagename
from the system. The function is successful and returns 0
if there are no pending references to the image, otherwise
it does not unregister the image and returns
.Er EBUSY .
.Pp
.Fn firmware_get
returns the requested firmware image.
If the image is not yet registered with the system,
the function tries to load it.
This involves filesystem I/O, and possibly the linker subsystem, so
.Fn firmware_get
must not be called with any locks (except for
.Va Giant ) .
Note also that the filesystem holding the firmware image must already
be mounted.
In particular this means that it may be necessary to defer requests
from a driver attach method unless it is known the root filesystem is
already mounted.
.Pp
On success,
.Fn firmware_get
returns a pointer to the image description and increases the reference count
for this image. On failure, the function returns NULL.
.Pp
.Fn firmware_put
drops a reference to a firmware image.
The
.Fa flags
argument may be set to
.Dv FIRMWARE_UNLOAD
to indicate that
firmware_put is free to reclaim resources associated with
the firmware image if this is the last reference.
By default a firmware image will be deferred to a
.Xr taskqueue 9
thread so the call may be done while holding a lock.
In certain cases, such as on driver detach, this cannot be allowed.
.Sh FIRMWARE LOADING MECHANISMS
Any component of the system can register firmware images at any time by
calling
.Fn firmware_register ,
and a module containing an image does exactly that when it is given
control, whether compiled in, preloaded, or loaded with
.Xr kldload 8 .
.Pp
When
.Fn firmware_get
does not find the image already registered, it tries three sources in the
order below.
The order is by how little each one needs, which is also the order of how
early each one works:
.Bl -bullet
.It
A preloaded image is already in memory.
It is the only source that works before the root filesystem is mounted,
and so the only one that can serve firmware for the device the root
filesystem is on.
.It
A file needs a mounted filesystem, which is soon enough for anything that
is not involved in mounting it - a graphics adapter, a wireless interface,
a sound device.
This is where the bulk of the images live, and where an update to them
arrives.
.It
A module needs the filesystem as well, plus the linker.
It remains because drivers that ask for a name of their own still have
their images packaged that way.
.El
.Pp
An administrator normally installs the images once, as a package, and
writes a line in
.Xr loader.conf 5
only for the few that are wanted before the root filesystem exists.
.Ss Preloaded images
An image the loader was told to preload is already in memory and is used
before anything that has to go and find one:
.Bd -literal
	nvgsp_load="YES"
	nvgsp_type="firmware"
	nvgsp_name="nvidia/tu102/gsp/gsp-570.144.bin"
.Ed
.Pp
The name in
.Xr loader.conf 5
is the name the driver asks for.
The loader searches
.Va module_path ,
which includes
.Pa /boot/firmware ,
and records the path it resolved; the image is matched by that name or by
the tail of it at a path boundary.
.Pp
This is the only source that works before the root file system is mounted,
which is what it is for: firmware for the device the root file system lives
on cannot come from the root file system.
It is also the only source that works while the kernel is still
.Va cold ,
since both mechanisms below defer to a
.Xr taskqueue 9
thread that does not run yet.
.Pp
The memory belongs to the loader, not to the firmware subsystem, so such an
image is never unloaded.
.Ss Firmware files
A firmware image named
.Nm foo
is first looked up as a regular file named
.Nm foo
under each directory listed in the sysctl variable
.Va hw.firmware_path ,
a semicolon-separated list of directories which defaults to
.Pa /usr/local/lib/firmware;/lib/firmware .
The variable is also a tunable and may be set from
.Xr loader.conf 5 .
.Pp
The image name is used as a path relative to each directory in turn,
so a driver requesting the image
.Nm amdgpu/raven_vcn.bin
is served from
.Pa /usr/local/lib/firmware/amdgpu/raven_vcn.bin
when that file exists.
The first readable regular file wins.
.Pp
The contents of the file are copied into kernel memory and registered
under the image name.
Unlike a module-backed image, which merely borrows the module's memory,
this memory belongs to the firmware subsystem and is released when the
image is unregistered.
.Pp
Images larger than the sysctl variable
.Va hw.firmware_max_size ,
which defaults to 256 MB, are refused.
.Pp
This mechanism performs filesystem I/O, so the filesystem holding the
image must already be mounted; see the note under
.Fn firmware_get
above.
.Ss Loadable kernel modules
If no file was found, the image is looked up by trying to load the
module named
.Nm foo.ko ,
using the facilities described in
.Xr kld 4 .
In particular, modules are looked up in the directories specified
by the sysctl variable
.Va kern.module_path
which on most systems defaults to
.Pa /boot/kernel;/boot/modules .
.Pp
Note that in case a module contains multiple images,
the caller should first request a
.Fn firmware_get
for the first image contained in the module, followed by requests
for the other images.
.Pp
Because a file takes precedence over a module of the same name, a driver
requesting a flat image name such as
.Nm radeonkmsfw_BONAIRE_uvd
continues to be served by its module, while a driver requesting a
path-style name such as
.Nm amdgpu/raven_vcn.bin
is served from the filesystem.
This lets a system carry both conventions at once, and lets an
administrator override a module-backed image by installing a file of
the same name.
.Pp
Some modules refuse to register their image until a license has been
acknowledged, by way of a
.Va legal.NAME.license_ack
tunable, where NAME identifies the license.
The check is generated into the module's load handler ahead of
.Fn firmware_register ,
so it exists on this path and no other: an image obtained from a file or
from a preload is never checked.
.Pp
An image that carries such a gate must therefore keep a flat name of its
own, so that it is always served by its module.
In this tree that is
.Nm urtwnrtl* ,
which wants
.Va legal.realtek.license_ack ,
and
.Nm iwi_* ,
which wants
.Va legal.intel_iwi.license_ack .
Renaming either to the name its firmware carries upstream would move it to
the filesystem and remove the gate, with nothing else to show for it.
.Sh BUILDING FIRMWARE LOADABLE MODULES
A firmware module is built by embedding the
.Nm firmware image
into a suitable loadable kernel module that calls
.Fn firmware_register
on loading, and
.Fn firmware_unregister
on unloading.
.Pp
Various system scripts and makefiles let you build a module
by simply writing a Makefile with the following entries:
.Bd -literal

        KMOD=   imagename
        FIRMWS= image_file:imagename[:version]
        FIRMWARE_LICENSE= license
        .include <bsd.kmod.mk>

.Ed
where KMOD is the basename of the module; FIRMWS is a list of
colon-separated tuples indicating the image_file's to be embedded
in the module, the imagename and version of each firmware image.
.Pp
FIRMWARE_LICENSE is optional.
When it is set, the module refuses to register anything until
.Va legal.NAME.license_ack
is set, and directs the reader to the matching directory under
.Pa /usr/share/doc/legal .
It exists because a firmware image built this way arrives with the system
source, so the user receives it without having been shown any terms.
An image that comes from a package does not have that problem, and no such
check is made on the other two paths.
.Pp
If you need to embed firmware images into a system, you should write
appropriate entries in the
.Li files
file.
This example is from
.Xr wpi 4 Ap s
firmware.
.Bd -literal
wpifw.c			optional wpifw					\\
	dependency	"$S/contrib/dev/wpi/iwlwifi-3945-2.14.4.fw.uu"	\\
	compile-with	"${AWK} -f $S/tools/fw_stub.awk wpi.fw:wpifw:2144 -mwpifw -c${.TARGET}" \\
	no-implicit-rule before-depend local				\\
	clean		"wpifw.c"
wpifw.fwo		optional wpifw					\\
	dependency	"wpi.fw"					\\
	compile-with	"${LD} -b binary -d -warn-common -r -d -o ${.TARGET} wpi.fw" \\
	no-implicit-rule						\\
	clean		"wpifw.fwo"
wpi.fw			optional wpifw					\\
	dependency	"$S/contrib/dev/wpi/iwlwifi-3945-2.14.4.fw.uu"	\\
	compile-with	"uudecode -o ${.TARGET} $S/contrib/dev/wpi/iwlwifi-3945-2.14.4.fw.uu" \\
	no-obj no-implicit-rule						\\
	clean		"wpi.fw"
.Ed
.Pp
Note that generating the firmware modules in this way requires
the availability of the following tools:
.Xr awk 1 ,
.Xr make 1 ,
the compiler and the linker.
.Sh SEE ALSO
.Xr kld 4 ,
.Xr loader.conf 5 ,
.Xr kldload 8 ,
.Xr loader 8 ,
.Xr sysctl 8 ,
.Xr module 9
.Pp
.Pa /usr/share/examples/kld/firmware
.Sh HISTORY
The
.Nm firmware
system was introduced in
.Fx 6.1 .
.Pp
Support for loading firmware images from the filesystem first appeared
in
.Dx 6.6 .
.Sh AUTHORS
This manual page was written by
.An Max Laier Aq Mt mlaier@FreeBSD.org .
