DragonFlyBSD/DragonFlyBSD/share/man/man9/hexncpy.9
.\"
.\" Copyright (c) 2013 The DragonFly Project.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\"
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in
.\"    the documentation and/or other materials provided with the
.\"    distribution.
.\" 3. Neither the name of The DragonFly Project nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific, prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
.\" LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
.\" FOR A PARTICULAR PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE
.\" COPYRIGHT HOLDERS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
.\" OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd February 7, 2012
.Dt HEXNCPY 9
.Os
.Sh NAME
.Nm hexncpy
.Nd converts a block of bytes into an ASCII string
.Sh SYNOPSIS
.In sys/libkern.h
.Ft char *
.Fn hexncpy "const u_char *inb" "int inlen" "char *outb" "int outlen" "const char *sep"
.Sh DESCRIPTION
The
.Fn hexncpy
function converts a block of bytes to an ASCII string which represents
its values as hex digits.
.Bl -tag -width indent
.It Fa inb
Pointer to the array of bytes to be converted.
.It Fa inlen
Number of bytes to parse from the input buffer.
.It Fa outb
Buffer to store the resulting string.
It should be large enough to hold all the hexadecimal characters that want to
be represented, the separators and the null terminator character.
.It Fa outlen
Number of bytes to store in the buffer.
.It Fa sep
Character to be used as separator
.El
.Sh RETURN VALUES
The
.Fn hexncpy
function returns a pointer to the string containing an ASCII representation
as hex digits of the values passed in
.Fa inb .
.Sh SEE ALSO
.Xr ascii 7 ,
.Xr hexdump 9 ,
.Xr kether_ntoa 9
.Sh HISTORY
The
.Fn hexncpy
function first appeared in
.Dx 3.3 .
