DragonFlyBSD/DragonFlyBSD/share/man/man9/KASSERT.9
.\" Copyright (c) 2004 Hiten Pandya <hmp@dragonflybsd.org>
.\" Copyright (c) 2000 Jonathan M. Bresler
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD: src/share/man/man9/KASSERT.9,v 1.1.2.4 2001/07/21 09:16:54 schweikh Exp $
.\" $DragonFly: src/share/man/man9/KASSERT.9,v 1.3 2004/05/10 12:22:36 hmp Exp $
.\"
.Dd May 10, 2004
.Os
.Dt KASSERT 9
.Sh NAME
.Nm KASSERT ,
.Nm KKASSERT
.Nd kernel expression verification macros
.Sh SYNOPSIS
.Cd options INVARIANTS
.Fn KASSERT expression "const char *msg"
.Fn KKASERT expression
.Sh DESCRIPTION
The macros described in this manual page are no-op unless the kernel
is compiled with
.Cd "options INVARIANTS" .
.Pp
The
.Fn KASSERT
macro tests the given
.Ar expression
and if it is false,
the
.Xr panic 9
function is called to display
.Fa msg
and terminate the running system.
.Pp
The
.Fn KKASSERT
macro is similar to
.Fn KASSERT ,
except it does not require a description message but instead
displays
.Fa expression
and terminates the running system.
.Sh EXAMPLES
The kernel function
.Fn vput
must not be called with a NULL pointer.
.Bd -literal -offset indent
void
vput(struct vnode *vp)
{
	struct thread *td = curthread;
	
	KASSERT(vp != NULL, ("vput: null vp"));
	...
}
.Ed
.Sh SEE ALSO
.Xr config 8 ,
.Xr panic 9 ,
.Sh AUTHORS
.An -nosplit
This manual page was written by
.An Jonathan M. Bresler
.Aq jmb@FreeBSD.org
and modified for
.Dx
by
.An Hiten Pandya Aq hmp@dragonflybsd.org .
