DragonFlyBSD/DragonFlyBSD/share/man/man9/kether_ntoa.9
.\"
.\" Copyright (c) 2013 The DragonFly Project.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\"
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in
.\"    the documentation and/or other materials provided with the
.\"    distribution.
.\" 3. Neither the name of The DragonFly Project nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific, prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
.\" LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
.\" FOR A PARTICULAR PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE
.\" COPYRIGHT HOLDERS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
.\" OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd February 7, 2012
.Dt KETHER_NTOA 9
.Os
.Sh NAME
.Nm kether_ntoa ,
.Nm kether_aton
.Nd ethernet address conversion routines
.Sh SYNOPSIS
.In net/if_var.h
.Ft char *
.Fn kether_ntoa "const u_char *addr" "char *buf"
.Ft u_char *
.Fn kether_aton "const char *macstr" "u_char *addr"
.Sh DESCRIPTION
The
.Fn kether_ntoa
function converts the ethernet address specified in
.Fa addr
to its corresponding hexadecimal ASCII representation.
Likewise, the
.Fn kether_aton
function converts an ASCII
string specified in
.Fa macstr
to an ethernet address.
.Pp
.Fn kether_ntoa
serves a similar purpose as the former, non-standard
.Cm D
conversion of
.Xr kprintf 9
(as in,
.Dq %6D )
which some
.Bx Ns s
still have.
.Pp
Notational conventions for hexadecimal ASCII
representation of a MAC
address are specified in IEEE 802.
.Sh RETURN VALUES
The
.Fn kether_ntoa
function returns a pointer to the string containing the hexadecimal ASCII
representation of the ethernet address passed in
.Fa addr ,
or NULL in the case of failure.
.Pp
The
.Fn kether_aton
function returns a pointer to a block of bytes containing the conversion
of the specified ASCII
string in
.Fa macstr ,
or NULL in the case of failure.
.Sh SEE ALSO
.Xr ascii 7 ,
.Xr hexdump 9 ,
.Xr hexncpy 9
.Sh HISTORY
The
.Fn kether_ntoa
and
.Fn kether_aton
functions first appeared in
.Dx 3.3 .
