DragonFlyBSD/DragonFlyBSD/share/man/man9/vcount.9
.\"
.\" Copyright (c) 2009
.\"	The DragonFly Project.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\"
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in
.\"    the documentation and/or other materials provided with the
.\"    distribution.
.\" 3. Neither the name of The DragonFly Project nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific, prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
.\" LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
.\" FOR A PARTICULAR PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE
.\" COPYRIGHT HOLDERS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
.\" OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd December 14, 2009
.Dt VCOUNT 9
.Os
.Sh NAME
.Nm vcount ,
.Nm count_dev
.Nd "get total number of references to a device"
.Sh SYNOPSIS
.In sys/conf.h
.In sys/vnode.h
.Ft int
.Fn vcount "struct vnode *vp"
.Ft int
.Fn count_dev "cdev_t dev"
.Sh DESCRIPTION
.Fn vcount
is used to get the number of references to a special device.
This makes sense because multiple vnodes may reference the same device.
.Pp
.Fn count_dev
does the same thing as
.Fn vcount ,
but takes a
.Vt cdev_t
rather than a
.Vt "struct vnode"
pointer as an argument.
It may only be called for
.Dv VBLK
and
.Dv VCHR
vnodes since
.Fa v_rdev
is an overloaded field.
.Sh RETURN VALUES
.Fn vcount
and
.Fn count_dev
both return the number of references to the device.
.Sh SEE ALSO
.Xr vnode 9
