DragonFlyBSD/DragonFlyBSD/share/man/man9/VOP_FSYNC.9
.\" Copyright (c) 1996 Doug Rabson
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD: src/share/man/man9/VOP_FSYNC.9,v 1.6.2.2 2001/12/17 11:30:18 ru Exp $
.\"
.Dd September 14, 2021
.Dt VOP_FSYNC 9
.Os
.Sh NAME
.Nm VOP_FDATASYNC ,
.Nm VOP_FSYNC
.Nd flush filesystem buffers for a file
.Sh SYNOPSIS
.In sys/param.h
.In sys/vnode.h
.Ft int
.Fn VOP_FDATASYNC "struct vnode *vp" "int waitfor" "int flags"
.Ft int
.Fn VOP_FSYNC "struct vnode *vp" "int waitfor" "int flags"
.Sh DESCRIPTION
This call flushes any dirty filesystem buffers for the file.
It is used to implement the
.Xr sync 2
and
.Xr fsync 2
system calls.
.Pp
Its arguments are:
.Bl -tag -width waitfor
.It Ar vp
the vnode of the file.
.It Ar waitfor
whether the function should do data, meta-data updates or be full-synchronous.
.It Ar flags
are additional flags to be passed to the filesystem specific
.Xr fsync 2
function.
.El
.Pp
The argument
.Fa waitfor
can use the following flags:
.Bl -tag -width ".Dv MNT_NOWAIT"
.It Dv MNT_NOWAIT
is for an asynchronous data pass and a meta-data pass as well.
.It Dv MNT_LAZY
means a limited amount of data from dirty buffers and a full meta-data synchronization pass.
.It Dv MNT_WAIT
will make
.Xr syncer 4
try to do a full synchronization pass.
That is, a meta-data pass and multiple data passes.
.El
.Pp
The argument
.Fa flags
is to specify additional flags passed to the filesystem specific
.Xr fsync 2
call.
The only supported flag at the moment is
.Dv VOP_FSYNC_SYSCALL
which indicates the file synchronization was requested from userland.
.Pp
.Fn VOP_FDATASYNC
is similar, but it does not require that all of the file's metadata be flushed.
It only requires that the file's data be recoverable after a crash.
That implies that the data itself must be flushed to disk, as well as some
metadata such as the file's size but not necessarily its attributes.
.Fn VOP_FDATASYNC
should always wait for I/O to complete, as if called with
.Dv MNT_WAIT .
.Fn VOP_FDATASYNC
is used to implement
.Xr fdatasync 2 .
.Sh RETURN VALUES
Zero is returned if the call is successful, otherwise an appropriate
error code is returned.
.Sh ERRORS
.Bl -tag -width Er
.It Bq Er ENOSPC
The filesystem is full.
.It Bq Er EDQUOT
Quota exceeded.
.El
.Sh SEE ALSO
.Xr syncer 4 ,
.Xr vnode 9
.Sh AUTHORS
This man page was written by
.An Doug Rabson .
